





const arrListSheriffConstitution = [


/*
{
	id: '', art: '', title: '',
	descr: '',
	href: '',
},
*/




{
	id: 'art_10', art: '10', title: 'Державною мовою в Україні є українська мова.',
	descr: `
		<br/>
		Держава забезпечує всебічний розвиток і функціонування української мови в усіх сферах суспільного життя на всій території України.
		
		<br/>
		<br/>
		В Україні гарантується вільний розвиток, використання і захист російської, інших мов національних меншин України.
		
		<br/>
		<br/>
		Держава сприяє вивченню мов міжнародного спілкування.
		
		<br/>
		<br/>
		Застосування мов в Україні гарантується Конституцією України та визначається законом.
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/254%D0%BA/96-%D0%B2%D1%80#n4196',
},



{
	id: 'art_63', art: '63', title: 'Особа не несе відповідальності за відмову давати показання або пояснення щодо себе, членів сім\'ї чи близьких родичів, коло яких визначається законом.',
	descr: `
		<br/>Підозрюваний, обвинувачений чи підсудний має право на захист.
		<br/>Засуджений користується всіма правами людини і громадянина, за винятком обмежень, які визначені законом і встановлені вироком суду.
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/254%D0%BA/96-%D0%B2%D1%80#n4378',
},









];









let objListSheriffConstitution = {};
arrListSheriffConstitution.forEach( k => {
	objListSheriffConstitution[ k.id ] = k;
});







