






const arrListSheriffSmoking = [

/*
{
	id: 'smoking', title: 'ЗУ \"Про заходи щодо попередження та зменшення вживання тютюнових виробів і їх шкідливого впливу на здоров\'я населення\"',
	href: 'https://zakon.rada.gov.ua/laws/show/2899-15#Text',
},
*/

{

	id: 'a13', a: '13', title: 'Обмеження щодо реалізації (продажу), куріння, вживання та використання тютюнових виробів, предметів, пов’язаних з їх вживанням, трав’яних виробів для куріння, електронних сигарет, заправних контейнерів, пристроїв для споживання тютюнових виробів без їх згоряння.',
	descr: `
		<p>Реалізація (продаж) тютюнових виробів, предметів, пов’язаних з їх вживанням, трав’яних виробів для куріння, електронних сигарет, заправних контейнерів, пристроїв для споживання тютюнових виробів без їх згоряння особам, які не досягли 18 років, а також реалізація (продаж) тютюнових виробів в одиничних пачках, що містять менше 20 сигарет, сигарил або цигарок, чи поштучно (крім сигар) забороняються.</p>
		<p>Забороняється куріння, вживання та використання тютюнових виробів, предметів, пов’язаних з їх вживанням, трав’яних виробів для куріння, електронних сигарет, пристроїв для споживання тютюнових виробів без їх згоряння, кальянів:</p>
		<p>1) у ліфтах і таксофонах;</p>
		<p>2) у приміщеннях та на території закладів охорони здоров’я;</p>
		<p>3) у приміщеннях та на території навчальних закладів;</p>
		<p>4) у приміщеннях та на території спортивних і фізкультурно-оздоровчих споруд та закладів фізичної культури і спорту;</p>
		<p>5) у приміщеннях закладів ресторанного господарства;</p>
		<p>6) у приміщеннях об’єктів культурного призначення;</p>
		<p>7) у приміщеннях органів державної влади, інших державних установ, органів місцевого самоврядування;</p>
		<p>8) у приміщеннях підприємств, установ та організацій усіх форм власності;</p>
		<p>9) у приміщеннях готелів та аналогічних засобів розміщення громадян;</p>
		<p>10) у приміщеннях гуртожитків;</p>
		<p>11) на дитячих майданчиках;</p>
		<p>12) у місцях загального користування житлових будинків;</p>
		<p>13) у підземних переходах;</p>
		<p>14) у транспорті загального користування, що використовується для перевезення пасажирів, у тому числі в таксі;</p>
		<p>15) на вокзалах та станціях;</p>
		<p>16) на зупинках громадського транспорту.</p>

		<p>Забороняється куріння, вживання, використання тютюнових виробів, електронних сигарет, пристроїв для споживання тютюнових виробів без їх згоряння, кальянів в аеропортах, крім спеціально відведених для цього місць.</p>
		<p>У місцях та закладах, в яких куріння, вживання, використання тютюнових виробів, електронних сигарет, пристроїв для споживання тютюнових виробів без їх згоряння, кальянів заборонено, розміщується наочна інформація, що складається з графічного знака про заборону куріння і тексту такого змісту: "Куріння, вживання, використання тютюнових виробів, електронних сигарет, пристроїв для споживання тютюнових виробів без їх згоряння, кальянів заборонено!".</p>
		<p>У спеціально відведених в аеропортах місцях для куріння, вживання, використання тютюнових виробів, електронних сигарет, пристроїв для споживання тютюнових виробів без їх згоряння, кальянів розміщується наочна інформація, що складається з графічного знака і тексту такого змісту: "Місце для куріння. Куріння шкодить Вашому здоров’ю!".</p>
		<p>Адміністрація аеропортів може відводити спеціальні місця для куріння, вживання, використання тютюнових виробів, електронних сигарет, пристроїв для споживання тютюнових виробів без їх згоряння, кальянів, загальна площа яких не може перевищувати 5 відсотків загальної площі споруди аеропорту, за умови розташування таких місць в окремих відокремлених приміщеннях, які не мають потреби відвідувати люди, що не курять, не вживають, не використовують тютюнові вироби, електронні сигарети, пристрої для споживання тютюнових виробів без їх згоряння, та обладнання їх витяжною вентиляцією, а також розміщення інформації, передбаченої частиною п’ятою цієї статті.</p>
		<p>Сільські, селищні та міські ради у межах відповідної адміністративно-територіальної одиниці можуть постійно або тимчасово заборонити куріння, вживання, використання тютюнових виробів, електронних сигарет, тютюнових виробів без їх згоряння та кальянів у додатково визначених ними місцях.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/2899-15#n163',




},




];









let objListSheriffSmoking = {};
arrListSheriffSmoking.forEach( k => {
	objListSheriffSmoking[ k.id ] = k;
});







