














const arrListSheriffAlco = [
/*
{
	id: 'alco', title: 'ЗУ \"Про державне регулювання виробництва і обігу спирту етилового, коньячного і плодового, алкогольних напоїв, тютюнових виробів, рідин, що використовуються в електронних сигаретах, та пального\"',
	href: 'https://zakon.rada.gov.ua/laws/show/481/95-%D0%B2%D1%80#Text',
},
*/

	
{

	id: 'a15_2', a: '15-2', title: 'Обмеження щодо споживання пива (крім безалкогольного), алкогольних, слабоалкогольних напоїв, вин столових, вживання тютюнових виробів, використання електронних сигарет та пристроїв для споживання тютюнових виробів без їх згоряння.',
	descr: `

		<p>Забороняється споживання пива (крім безалкогольного), алкогольних та слабоалкогольних напоїв, вин столових:</p>

		<p>1) у закладах охорони здоров’я (крім споживання вин столових на території санаторіїв у спеціально відведених місцях);</p>
		<p>2) у закладах освіти;</p>
		<p>3) у громадському транспорті (включаючи транспорт міжнародного сполучення), на зупинках транспорту, у підземних переходах;</p>
		<p>4) у закладах культури;</p>
		<p>5) у закритих спортивних спорудах (крім пива у пластиковій тарі);</p>
		<p>6) у ліфтах і таксофонах;</p>
		<p>7) на дитячих майданчиках;</p>
		<p>8) на спортивних майданчиках;</p>
		<p>9) у приміщеннях органів державної влади та органів місцевого самоврядування, інших державних установ;</p>
		<p>10) у місцях проведення спортивних змагань за участю дітей.</p>
		
		<p>Обмеження щодо вживання тютюнових виробів, використання електронних сигарет та пристроїв для споживання тютюнових виробів без їх згоряння та відповідальність за їх порушення встановлюються Законом України "Про заходи щодо попередження та зменшення вживання тютюнових виробів і їх шкідливого впливу на здоров’я населення" та Кодексом України про адміністративні правопорушення.</p>
		<p>На час проведення масових заходів сільські, селищні та міські ради в межах відповідної адміністративно-територіальної одиниці можуть заборонити або обмежити споживання пива (крім пива у пластиковій тарі), алкогольних, слабоалкогольних напоїв, вин столових, куріння тютюнових виробів, використання електронних сигарет та пристроїв для споживання тютюнових виробів без їх згоряння.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/481/95-%D0%B2%D1%80#n599',
},
{

	id: 'a15_3', a: '15-3', title: 'Обмеження щодо продажу пива (крім безалкогольного), алкогольних, слабоалкогольних напоїв, вин столових, тютюнових виробів, електронних сигарет, рідин, що використовуються в електронних сигаретах, та пристроїв для споживання тютюнових виробів без їх згоряння.',
	descr: `

		<p>Забороняється продаж пива (крім безалкогольного), алкогольних, слабоалкогольних напоїв, вин столових, тютюнових виробів, електронних сигарет, рідин, що використовуються в електронних сигаретах, пристроїв для споживання тютюнових виробів без їх згоряння:</p>
		<p>
			1) особами, які не досягли 18 років;<br/>
			2) особам, які не досягли 18 років.
		</p>
		<p>Забороняється продаж пива (крім безалкогольного), алкогольних, слабоалкогольних напоїв, вин столових, тютюнових виробів, електронних сигарет та рідин, що використовуються в електронних сигаретах, пристроїв для споживання тютюнових виробів без їх згоряння:</p>
		<p>1) у приміщеннях та на території навчальних закладів, закладів охорони здоров’я (крім ресторанів, що знаходяться на території санаторіїв);</p>
		<p>2) у приміщеннях спеціалізованих торговельних організацій, що здійснюють торгівлю товарами дитячого асортименту або спортивними товарами, а також у відповідних відділах (секціях) універсальних торговельних організацій;</p>
		<p>3) у закритих спортивних спорудах (крім пива у пластиковій тарі);</p>
		<p>4) з торгових автоматів;</p>
		<p>5) на полицях самообслуговування (крім тютюнових виробів у блоках та алкогольних, слабоалкогольних напоїв, вин столових, пива);</p>
		<p>6) поштучно (для тютюнових виробів, крім сигар);</p>
		<p>7) з рук, лотків;</p>
		<p>8) у одиничних пачках, що містять менше 20 сигарет;</p>
		<p>9) у невизначених для цього місцях торгівлі.</p>
		<p>Забороняється продаж будь-яких товарів дитячого асортименту, що імітують тютюнові вироби, електронні сигарети, пристрої для споживання тютюнових виробів без їх згоряння.</p>
		<p>На час проведення масових заходів сільські, селищні та міські ради в межах відповідної адміністративно-територіальної одиниці можуть заборонити або обмежити продаж пива (крім пива у пластиковій тарі), алкогольних, слабоалкогольних напоїв, вин столових та куріння тютюнових виробів, використання електронних сигарет, пристроїв для споживання тютюнових виробів без їх згоряння.</p>
		<p>Якщо у продавця пива (крім безалкогольного), алкогольних, слабоалкогольних напоїв, вин столових, тютюнових виробів, електронних сигарет, рідин, що використовуються в електронних сигаретах, пристроїв для споживання тютюнових виробів без їх згоряння виникли сумніви щодо досягнення 18-річного віку покупцем, який купує пиво (крім безалкогольного), алкогольні, слабоалкогольні напої, вина столові, тютюнові вироби, електронні сигарети, рідини, що використовуються в електронних сигаретах, та пристрої для споживання тютюнових виробів без їх згоряння, продавець зобов’язаний звернутися до такого покупця з вимогою пред’явити паспорт громадянина України або інший документ, що підтверджує його вік.</p>
		<p>У разі відмови покупця надати такий документ забороняється продаж пива (крім безалкогольного), алкогольних, слабоалкогольних напоїв, вин столових, тютюнових виробів, електронних сигарет, рідин, що використовуються в електронних сигаретах, пристроїв для споживання тютюнових виробів без їх згоряння такій особі.</p>
		<p>Продаж алкогольних напоїв на розлив для споживання на місці дозволяється тільки суб'єктам господарювання (у тому числі іноземним суб’єктам господарювання, які діють через свої зареєстровані постійні представництва) громадського харчування та спеціалізованим відділам, що мають статус суб'єктів господарювання (у тому числі іноземних суб’єктів господарювання, які діють через свої зареєстровані постійні представництва) громадського харчування, підприємств з універсальним асортиментом товарів.</p>
		<p>Продаж вин столових здійснюється без застосування реєстраторів розрахункових операцій з використанням книжок та книг обліку розрахункових операцій.</p>
		<p>Продаж вин з доданням спирту (виноматеріалів оброблених) виноградних власного виробництва ординарних та марочних на розлив з тари місткістю від 50 до 600 л дозволяється суб'єктам господарювання (у тому числі іноземним суб’єктам господарювання, які діють через свої зареєстровані постійні представництва) первинного та змішаного виноробства виключно за місцем розташування таких суб'єктів господарювання (у тому числі іноземних суб’єктів господарювання, які діють через свої зареєстровані постійні представництва) у межах адміністративно-територіальних одиниць (міст, селищ, сіл) із сплатою акцизного податку у розмірі, встановленому Податковим кодексом України, якщо у ліцензії на роздрібну торгівлю алкогольними напоями про це є відповідний запис органу, що видав таку ліцензію. Річні обсяги продажу вин (виноматеріалів оброблених) на розлив такими суб'єктами господарювання (у тому числі іноземними суб’єктами господарювання, які діють через свої зареєстровані постійні представництва) не можуть перевищувати 20 відсотків від річного обсягу вироблених виноматеріалів.</p>
		<p>Сільські, селищні та міські ради в межах території відповідної адміністративно-територіальної одиниці можуть встановлювати заборону продажу пива (крім безалкогольного), алкогольних, слабоалкогольних напоїв, вин столових суб’єктами господарювання (у тому числі іноземними суб’єктами господарювання, які діють через свої зареєстровані постійні представництва) (крім закладів ресторанного господарства) у визначений рішенням таких органів час доби.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/481/95-%D0%B2%D1%80#n622',
},





];






let objListSheriffAlco = {};
arrListSheriffAlco.forEach( k => {
	objListSheriffAlco[ k.id ] = k;
});







