

const arrListSheriffNpu = [




















{ 
	id: 'a_29', a: '29', title: 'Вимоги до поліцейського заходу.', 
	descr : `
		<p>1. Поліцейський захід - це дія або комплекс дій превентивного або примусового характеру, що обмежує певні права і свободи людини та застосовується поліцейськими відповідно до закону для забезпечення виконання покладених на поліцію повноважень.</p>
		<p>5. Застосований поліцейський захід є пропорційним, якщо шкода, заподіяна охоронюваним законом правам і свободам людини або інтересам суспільства чи держави, не перевищує блага, для захисту якого він застосований, або створеної загрози заподіяння шкоди.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n231', 
},
{ 
	id: 'a_31', a: '31', title: 'Превентивні поліцейські заходи.', 
	descr : `
		<p>1. Поліція може застосовувати такі превентивні заходи:</p>
			<p>1) перевірка документів особи;</p>
			<p>2) опитування особи;</p>
			<p>3) поверхнева перевірка і огляд;</p>
			<p>4) зупинення транспортного засобу;</p>
			<p>5) вимога залишити місце і обмеження доступу до визначеної території;</p>
			<p>6) обмеження пересування особи, транспортного засобу або фактичного володіння річчю;</p>
			<p>9) застосування технічних приладів і технічних засобів, що мають функції фото- і кінозйомки, відеозапису, засобів фото- і кінозйомки, відеозапису;</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n244', 
},
{ 
	id: 'a_32', a: '32', title: 'Перевірка документів особи.', 
	descr : `
		<p>1. Поліцейський має право вимагати в особи пред’явлення нею документів, що посвідчують особу, та/або документів, що підтверджують відповідне право особи, у спосіб, який дає можливість поліцейському прочитати та зафіксувати дані, що містяться в документах, у таких випадках:</p>
			<p>2) якщо існує достатньо підстав вважати, що особа вчинила або має намір вчинити правопорушення;</p>
			<p>5) якщо особа перебуває в місці вчинення правопорушення або дорожньо-транспортної пригоди, іншої надзвичайної події;</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n258', 
},
{ 
	id: 'a_33', a: '33', title: 'Опитування особи.', 
	descr : `
		<p>1. Поліцейський може опитати особу, якщо існує достатньо підстав вважати, що вона володіє інформацією, необхідною для виконання поліцейських повноважень.</p>
		<p>2. Надання особою інформації є добровільним. Особа може відмовитися від надання інформації. Проведення опитування неповнолітніх допускається тільки за участю батьків (одного з них), іншого законного представника або педагога.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n266', 
},
{ 
	id: 'a_34', a: '34', title: 'Поверхнева перевірка.', 
	descr : `
		<p>2. Поліцейський для здійснення поверхневої перевірки особи може зупиняти осіб та/або оглядати їх, якщо існує достатньо підстав вважати, що особа має при собі річ, обіг якої заборонено чи обмежено або яка становить загрозу життю чи здоров’ю такої особи або інших осіб.</p>
		<p>4. Поліцейський може здійснювати поверхневу перевірку речі або транспортного засобу:</p>
			<p>1) якщо існує достатньо підстав вважати, що в транспортному засобі знаходиться правопорушник або особа, свобода якої обмежується в незаконний спосіб;
			<p>2) якщо існує достатньо підстав вважати, що в транспортному засобі знаходиться річ, обіг якої заборонено чи обмежено або яка становить загрозу життю чи здоров’ю такої особи або інших осіб;</p>
			<p>3) якщо існує достатньо підстав вважати, що річ або транспортний засіб є знаряддям вчинення правопорушення та/або знаходиться в тому місці, де може бути скоєно кримінальне правопорушення, для запобігання якого необхідно провести поверхневу перевірку.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n271', 
},
{ 
	id: 'a_35', a: '35', title: 'Зупинення транспортного засобу.', 
	descr : `
		<p>1. Поліцейський може зупиняти транспортні засоби у разі:</p>
			<p>1) якщо водій порушив Правила дорожнього руху;</p>
			<p>2) якщо є очевидні ознаки, що свідчать про технічну несправність транспортного засобу;</p>
			<p>4) якщо транспортний засіб перебуває в розшуку;</p>
			<p>6) якщо необхідно залучити водія транспортного засобу до надання допомоги іншим учасникам дорожнього руху або поліцейським або як свідка під час оформлення протоколів про адміністративні правопорушення чи матеріалів дорожньо-транспортних пригод;</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n282', 
},
{ 
	id: 'a_36', a: '36', title: 'Вимога залишити місце і обмеження доступу на визначену територію.', 
	descr : `
		<p>1. Поліцейський уповноважений вимагати від особи (осіб) залишити визначене місце на певний строк або заборонити чи обмежити особам доступ до визначеної території або об’єктів, якщо це необхідно для забезпечення публічної безпеки і порядку, охорони життя і здоров’я людей, для збереження та фіксації слідів правопорушення.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n294', 
},
{ 
	id: 'a_40', a: '40', title: 'Застосування технічних приладів, технічних засобів та спеціалізованого програмного забезпечення.', 
	descr : `
		<p>1. Поліція для виконання покладених на неї завдань та здійснення повноважень, визначених законом, може застосовувати такі технічні прилади, технічні засоби та спеціалізоване програмне забезпечення:</p>
			<p>1) фото- і відеотехніку, у тому числі техніку, що працює в автоматичному режимі, технічні прилади та технічні засоби з виявлення та/або фіксації правопорушень;</p>
			<p>4) спеціальні технічні засоби перевірки на наявність стану алкогольного сп'яніння;</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n318', 
},
{ 
	id: 'a_42', a: '42', title: 'Поліцейські заходи примусу.', 
	descr : `
		<p>1. Поліція під час виконання повноважень, визначених цим Законом, уповноважена застосовувати такі заходи примусу:</p>
			<p>1) фізичний вплив (сила);</p>
			<p>2) застосування спеціальних засобів;</p>
			<p>3) застосування вогнепальної зброї.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n343', 
},
{ 
	id: 'a_44', a: '44', title: 'Застосування фізичної сили.', 
	descr : `
		<p>1. Поліцейський може застосовувати <span class="keyword">фізичну силу</span>, у тому числі спеціальні прийоми боротьби (рукопашного бою), для забезпечення особистої безпеки або/та безпеки інших осіб, припинення правопорушення, затримання особи, яка вчинила правопорушення, якщо застосування інших поліцейських заходів не забезпечує виконання поліцейським повноважень, покладених на нього законом.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n374', 
},
{ 
	id: 'a_45', a: '45', title: 'Застосування спеціальних засобів.', 
	descr : `
		<p>3. Загальні правила застосування спеціальних засобів:</p>
			<p>1) <span class="keyword">кайданки</span> та інші засоби обмеження рухомості застосовуються:</p>
				<p>а) до особи, яка підозрюється у вчиненні кримінального правопорушення та чинить опір поліцейському або намагається втекти;</p>
				<p>б) під час затримання особи;</p>
				<p>в) під час конвоювання (доставляння) затриманого або заарештованого;</p>
				<p>г) якщо особа своїми небезпечними діями може завдати шкоду собі і оточуючим;</p>
				<p>ґ) проведення процесуальних дій з особами у випадках, коли вони можуть створити реальну небезпеку оточуючим або собі;</p>
				
			<p>2) гумові та пластикові <span class="keyword">кийки</span> застосовуються для:</p>
				<p>а) відбиття нападу на поліцейського, іншу особу та/або об’єкт, що перебуває під охороною;</p>
				<p>б) припинення групового порушення громадської безпеки і порядку чи масових заворушень;</p>
				<p>в) затримання особи, яка вчинила правопорушення і чинить злісну непокору законній вимозі поліцейського;</p>
			
			<p>3) засоби, споряджені речовинами <span class="keyword">сльозогінної</span> та дратівної дії, застосовуються для:</p>
				<p>а) відбиття нападу на поліцейського, іншу особу та/або об’єкт, що перебуває під охороною;</p>
				<p>б) припинення групового порушення громадської безпеки і порядку чи масових заворушень;</p>
			
		<p>4. Поліції (поліцейському) <span class="danger">заборонено</span>:</p>
			<p>1) наносити удари гумовими (пластиковими) кийками по голові, шиї, ключичній ділянці, статевих органах, попереку (куприку) і в живіт;</p>
			<p>2) під час застосування засобів, споряджених речовинами сльозогінної та дратівної дії, здійснювати прицільну стрільбу по людях, розкидання і відстрілювання гранат у натовп, повторне застосування їх у межах зони ураження в період дії цих речовин;</p>
			<p>6) застосовувати кайданки більше ніж 2 години безперервного використання або без послаблення їх тиску.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n377', 
},
{ 
	id: 'a_46', a: '46', title: 'Застосування вогнепальної зброї.', 
	descr : `
		<p>1. Застосування вогнепальної зброї є найбільш суворим заходом примусу.</p>
		<p>2. Поліцейський уповноважений на зберігання, носіння вогнепальної зброї, а також на її застосування і використання лише за умови що він пройшов відповідну спеціальну підготовку.</p>
		<p>3. Порядок зберігання і носіння вогнепальної зброї, що знаходиться в розпорядженні поліцейського, перелік вогнепальної зброї та боєприпасів, що використовуються в діяльності поліції, та норми їх належності встановлюються Міністром внутрішніх справ України.</p>
		<p>4. Поліцейський уповноважений у виняткових випадках застосовувати вогнепальну зброю:</p>
			<p>1) для відбиття нападу на поліцейського або членів його сім\'ї, у випадку загрози їхньому життю чи здоров\'ю;</p>
			<p>2) для захисту осіб від нападу, що загрожує їхньому життю чи здоров\'ю;</p>
			<p>3) для звільнення заручників або осіб, яких незаконно позбавлено волі;</p>
			<p>4) для відбиття нападу на об\'єкти, що перебувають під охороною, конвої, житлові та нежитлові приміщення, а також звільнення таких об\'єктів у разі їх захоплення;</p>
			<p>5) для затримання особи, яку застали під час вчинення тяжкого або особливо тяжкого злочину і яка намагається втекти;</p>
			<p>6) для затримання особи, яка чинить збройний опір, намагається втекти з-під варти, а також озброєної особи, яка погрожує застосуванням зброї та інших предметів, що загрожують життю і здоров\'ю людей та/або поліцейського;</p>
			<p>7) для зупинки транспортного засобу шляхом його пошкодження, якщо водій своїми діями створює загрозу життю чи здоров\'ю людей та/або поліцейського;</p>
			<p>8) для примусового припинення польоту безпілотного повітряного судна, якщо є обґрунтовані підстави вважати, що таке судно використовується для вчинення правопорушення або становить загрозу життю чи здоров\'ю людей та/або поліцейського, шляхом пошкодження чи знищення безпілотного повітряного судна та/або складових частин безпілотної авіаційної системи.</p>
	
		<p>5. Поліцейський уповноважений застосовувати вогнепальну зброю тільки після попередження про необхідність припинення протиправних дій і намір використання заходу примусу, визначеного цією статтею.</p>
		<p>6. Застосування вогнепальної зброї без попередження допускається:</p>
			<p>1) при спробі особи, яку затримує поліцейський із вогнепальною зброєю в руках, наблизитися до нього, скоротивши визначену ним відстань, чи доторкнутися до зброї;</p>
			<p>2) у разі збройного нападу, а також у разі раптового нападу із застосуванням бойової техніки, транспортних засобів або інших засобів, що загрожують життю чи здоров\'ю людей;</p>
			<p>3) якщо особа, затримана або заарештована за вчинення особливо тяжкого чи тяжкого злочину, втікає із застосуванням транспортного засобу;</p>
			<p>4) якщо особа чинить збройний опір;</p>
			<p>5) для припинення спроби заволодіти вогнепальною зброєю.</p>
			
		<p>7. Поліцейський уповноважений застосовувати вогнепальну зброю тільки з метою заподіяння особі такої шкоди, яка є необхідною і достатньою в такій обстановці, для негайного відвернення чи припинення збройного нападу.</p>
		<p>8. Поліцейський уповноважений застосовувати вогнепальну зброю у разі збройного нападу, якщо відвернення чи припинення відповідного нападу неможливо досягнути іншими засобами.</p>
		<p>9. Поліцейському заборонено застосовувати вогнепальну зброю в місцях, де може бути завдано шкоди іншим особам, а також у вогненебезпечних та вибухонебезпечних місцях, крім випадків необхідності відбиття нападу або крайньої необхідності.</p>
		<p>10. Поліцейський зобов\'язаний у письмовій формі повідомляти свого керівника про застосування вогнепальної зброї, а також негайно повідомити свого керівника про активне застосування вогнепальної зброї, який, у свою чергу, зобов\'язаний поінформувати центральний орган управління поліції та відповідного прокурора.</p>
		<p>11. Поліцейський може взяти до рук вогнепальну зброю і привести її у готовність, якщо вважає, що в обстановці, що склалася, можуть виникнути підстави для її застосування.</p>
		<p>12. Під час затримання осіб, щодо яких у поліцейського виникла підозра у вчиненні тяжкого чи особливо тяжкого злочину, а також під час перевірки документів у таких осіб поліцейський може привести в готовність вогнепальну зброю та попередити особу про можливість її застосування.</p>
			<p>Спроба особи, яку затримує поліцейський із вогнепальною зброєю в руках, наблизитися до нього, скоротивши визначену поліцейським відстань, чи доторкнутися до зброї є підставою для застосування вогнепальної зброї поліцейським.</p>
		<p>13. Поліцейський може використати вогнепальну зброю для подання сигналу тривоги або виклику допоміжних сил, або для знешкодження тварини, яка загрожує життю чи здоров\'ю поліцейського та інших осіб.</p>
	`,

	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n446', 
},
{ 
	id: 'a_62', a: '62', title: 'Гарантії професійної діяльності поліцейського.', 
	descr : `
		<p>10. Поліцейський:</p>
		<p>7) під час виконання поліцейських повноважень користується безоплатно всіма видами громадського транспорту міського, приміського і місцевого сполучення (крім таксі), а також попутним транспортом. Поліцейські, які виконують повноваження поліції на транспортних засобах, крім того, мають право на безоплатний проїзд у поїздах, на річкових і морських суднах. Під час службових відряджень поліцейські мають право на позачергове придбання квитків на всі види транспорту і розміщення в готелях при пред’явленні службового посвідчення та посвідчення про відрядження;</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n637', 
},
{ 
	id: 'a_66', a: '66', title: 'Службове сумісництво поліцейських.', 
	descr : `
		<p>1. Поліцейський не може під час проходження служби займатися іншою оплачуваною діяльністю, крім науково-педагогічної, наукової або творчої.</p>
	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n712', 
},





















/*


{ 
	id: 'a_', a: '', title: '', 
	descr : `
		<p></p>

	`,
	href: 'https://zakon.rada.gov.ua/laws/show/580-19#n ', 
},



*/























];









let objListSheriffNpu = {};
arrListSheriffNpu.forEach( k => {
	objListSheriffNpu[ k.id ] = k;
});







