const arrListSheriffFabulyType = [

	{ id: 'all' 			, title: 'Всі' 				, },
	{ id: 'move' 			, title: 'Рух ТЗ' 			, },
	{ id: 'stop' 			, title: 'Зупинка ТЗ' 		, },
	{ id: 'doc' 			, title: 'Документи' 		, },
	{ id: 'pedestrian' 		, title: 'Пішоходи' 		, },
	{ id: 'other' 			, title: 'Інші' 			, },

	//{ id: 'disrepair' 		, title: 'Несправність ТЗ' 	, },
];



let objListSheriffFabulyType = {};
arrListSheriffFabulyType.forEach( k => {
	objListSheriffFabulyType[ k.id ] = k;
});













const arrListSheriffFabuly = [

/*
{ 
	id 		: 'traffic_light_red',
	//title 	: 'здійснив проїзд на червоний сигнал світлофора, чим порушив п.8.7.3.е ПДР, чим скоїв адміністративне правопорушення, передбачене ч.2 ст.122 КУпАП.', 
	title 	: '', 
	//offense : 'ючи',
	//offense : 'вав',

	fabula 	: 'здійснив рух на заборонений червоний сигнал світлофора', 
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '8.7.3.e', 	


	img 	: 'light_left_no', // якщо є - то картинка звідси, якщо нема - картинка з ID

},
*/



{ 
	id 		: 'traffic_light_red', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив рух на заборонений червоний сигнал світлофора', 
	descr 	: 'ЧЕРВОНИЙ',
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '8.7.3.e',
	type 	: 'move',
},
{ 
	id 		: 'traffic_light_yellow', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив рух на заборонений жовтий сигнал світлофора', 
	descr 	: 'ЖОВТИЙ',
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '8.7.3.ґ',
	type 	: 'move',
},
{ 
	id 		: 'traffic_light_arrow', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив рух ( --прямо, --ліворуч, --праворуч ) на вимкнений сигнал додаткової секції світлофора', 
	descr 	: 'ВИМКНЕНА СЕКЦІЯ',
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '8.7.3.з',
	type 	: 'move',
},
{ 
	id 		: 'rod_up', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив рух на заборонений жест регулювальника (рука піднята вгору)', 
	descr 	: 'ЖЕЗЛ',
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '8.8.в',
	type 	: 'move',
},



{ 
	id 		: 'sign_2.1', edit: { d: '15', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, не надавши перевагу в русі ТЗ, яке рухалося по головній дорозі',
	descr 	: 'ДАЙ ДОРОГУ', 
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.б',
	sign 	: '2.1',
	type 	: 'move',
},
{ 
	id 		: 'sign_2.2', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши рух без зупинки',
	descr 	: 'ЗНАК СТОП', 
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.б',
	sign 	: '2.2',
	type 	: 'move',
},
{ 
	id 		: 'sign_2.5', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, не надавши перевагу в русі зустрічному ТЗ на вузькій ділянці',
	descr 	: 'ПЕРЕВАГА в РУСІ', 
	kupap 	: { art: '122', part: '2', },
	pdr 	: '8.4.б',
	sign 	: '2.5',
	type 	: 'move',
},



{ 
	id 		: 'sign_3.1', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши рух в зону дії знаку',
	descr 	: 'РУХ ЗАБОРОНЕНО', 
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
	sign 	: '3.1',
	type 	: 'move',
},
{ 
	id 		: 'sign_3.2', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши рух в зону дії знаку',
	descr 	: 'РУХ МЕХАНІЧНИХ ТЗ ЗАБОРОНЕНО', 
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
	sign 	: '3.2',
	type 	: 'move',
},
{ 
	id 		: 'sign_3.21', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши рух в зону дії знаку',
	descr 	: 'В\'ЇЗД ЗАБОРОНЕНО, «кирпич»',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
	sign 	: '3.21',
	type 	: 'move',
},
{ 
	id 		: 'sign_3.22', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши поворот праворуч',
	descr 	: 'ПОВОРОТ ЗАБОРОНЕНО',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
	sign 	: '3.22',
	type 	: 'move',
},
{ 
	id 		: 'sign_3.25', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив обгін в зоні дії знаку {sign}',
	descr 	: 'ОБГІН',
	kupap 	: { art: '122', part: '2', },
	pdr 	: '8.4.в',
	sign 	: '3.25',
	type 	: 'move',
},
{ 
	id 		: 'sign_3.29_20', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'перевищів встановлене обмеження швидкості руху ТЗ більш ніж на двадцять кілометрів на годину в зоні дії знаку {sign}. Швидкість руху вимірювалась приладом ( --назва, №... )',
	descr 	: 'ПЕРЕВИЩЕННЯ на 20 км/год',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '12.9.б',
	sign 	: '3.29',
	type 	: 'move',
},
{ 
	id 		: 'sign_3.29_50', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'перевищів встановлене обмеження швидкості руху ТЗ більш ніж на п’ятдесят кілометрів на годину в зоні дії знаку {sign}. Швидкість руху вимірювалась приладом ( --назва, №... )',
	descr 	: 'ПЕРЕВИЩЕННЯ на 50 км/год',
	kupap 	: { art: '122', part: '4', },
	pdr 	: '12.9.б',
	sign 	: '3.29',
	type 	: 'move',
},
{ 
	id 		: 'sign_3.34', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши зупинку в зоні дії знаку',
	descr 	: 'ЗУПИНКА під ЗНАКОМ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
	sign 	: '3.34',
	type 	: 'stop',
},
{ 
	id 		: 'sign_3.35', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши стоянку в зоні дії знаку',
	descr 	: 'СТОЯНКА під ЗНАКОМ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
	sign 	: '3.35',
	type 	: 'stop',
},
{ 
	id 		: 'sign_3.41', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши рух без зупинки',
	descr 	: 'СТОП-Контроль',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
	sign 	: '3.41',
	type 	: 'move',
},
{ 
	id 		: 'sign_4.1', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши поворот ( --ліворуч, )',
	descr 	: 'НАПРЯМКИ РУХУ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.г',
	sign 	: '4.1',
	type 	: 'move',
},
{ 
	id 		: 'sign_4.2', edit: { d: '15', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши ( --рух прямо, --поворот ліворуч, )',
	descr 	: 'НАПРЯМКИ РУХУ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.г',
	sign 	: '4.2',
	type 	: 'move',
},
{ 
	id 		: 'sign_4.5', edit: { d: '15', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши ( --поворот праворуч, )',
	descr 	: 'НАПРЯМКИ РУХУ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.г',
	sign 	: '4.5',
	type 	: 'move',
},
{ 
	id 		: 'sign_4.6', edit: { d: '15', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши рух прямо',
	descr 	: 'НАПРЯМКИ РУХУ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.г',
	sign 	: '4.6',
	type 	: 'move',
},
{ 
	id 		: 'sign_4.7', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши об\'їзд перешкоди з лівого боку',
	descr 	: 'ОБ\'ЇЗД ПЕРЕШКОДИ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.г',
	sign 	: '4.7',
	type 	: 'move',
},






{ 
	id 		: 'sign_5.8_move', img: 'sign_5.8', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'на дорозі із смугою для маршрутних ТЗ, позначеній дорожнім знаком {sign} здійснив рух на цій смузі',
	descr 	: 'РУХ по СМУЗІ МАРШРУТНИХ ТЗ',
	kupap 	: { art: '122', part: '3', },
	pdr 	: '17.1',
	sign 	: '5.8',
	type 	: 'move',
},
{ 
	id 		: 'sign_5.8_stop', img: 'sign_5.8', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'на дорозі із смугою для маршрутних ТЗ, позначеній дорожнім знаком {sign} здійснив зупинку на цій смузі',
	descr 	: 'ЗУПИНКА на СМУЗІ МАРШРУТНИХ ТЗ',
	kupap 	: { art: '122', part: '3', },
	pdr 	: '17.1',
	sign 	: '5.8',
	type 	: 'stop',
},
{ 
	id 		: 'sign_5.11_move', img: 'sign_5.11', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'на дорозі із смугою для маршрутних ТЗ, позначеній дорожнім знаком {sign} здійснив рух на цій смузі',
	descr 	: 'РУХ по СМУЗІ МАРШРУТНИХ ТЗ',
	kupap 	: { art: '122', part: '3', },
	pdr 	: '17.1',
	sign 	: '5.11',
	type 	: 'move',
},
{ 
	id 		: 'sign_5.11_stop', img: 'sign_5.11', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'на дорозі із смугою для маршрутних ТЗ, позначеній дорожнім знаком {sign} здійснив зупинку на цій смузі',
	descr 	: 'ЗУПИНКА на СМУЗІ МАРШРУТНИХ ТЗ',
	kupap 	: { art: '122', part: '3', },
	pdr 	: '17.1',
	sign 	: '5.11',
	type 	: 'stop',
},
{ 
	id 		: 'sign_5.16', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не виконав вимогу дорожнього знаку {sign}, здійснивши рух ( --прямо, --ліворуч, --праворуч ) зі смуги з якої дозволено рух тільки ( --прямо, --прямо або ліворуч, --прямо або праворуч, --ліворуч, --праворуч )',
	descr 	: 'РУХ ПО СМУГАХ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.ґ',
	sign 	: '5.16',
	type 	: 'move',
},
{ 
	id 		: 'stop_sign_5.38.1', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив зупинку ближче 10 м від пішохідного переходу, позначеного знаком {sign}',
	descr 	: 'ЗУПИНКА на ПЕРЕХОДІ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '15.9.г',
	sign 	: '5.38.1',
	type 	: 'stop',
},
{ 
	id 		: 'stop_sign_5.38.2', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив зупинку ближче 10 м від пішохідного переходу, позначеного знаком {sign}',
	descr 	: 'ЗУПИНКА на ПЕРЕХОДІ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '15.9.г',
	sign 	: '5.38.2',
	type 	: 'stop',
},
{ 
	id 		: 'stop_sign_5.45.1', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив зупинку ближче 30 м від посадкового майданчику для зупинки маршрутних ТЗ, позначеного знаком {sign}',
	descr 	: 'ЗУПИНКА на ЗУПИНЦІ МАРШРУТНИХ ТЗ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '15.9.е',
	sign 	: '5.45.1',
	type 	: 'stop',
},
{ 
	id 		: 'stop_sign_5.46.1', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив зупинку ближче 30 м від посадкового майданчику для зупинки маршрутних ТЗ, позначеного знаком {sign}',
	descr 	: 'ЗУПИНКА на ЗУПИНЦІ МАРШРУТНИХ ТЗ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '15.9.е',
	sign 	: '5.46.1',
	type 	: 'stop',
},
{ 
	id 		: 'stop_sign_5.47.1', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив зупинку ближче 30 м від посадкового майданчику для зупинки маршрутних ТЗ, позначеного знаком {sign}',
	descr 	: 'ЗУПИНКА на ЗУПИНЦІ МАРШРУТНИХ ТЗ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '15.9.е',
	sign 	: '5.47.1',
	type 	: 'stop',
},
{ 
	id 		: 'stop_sign_5.48', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив зупинку ближче 30 м від посадкового майданчику для зупинки маршрутних ТЗ, позначеного знаком {sign}',
	descr 	: 'ЗУПИНКА на ЗУПИНЦІ МАРШРУТНИХ ТЗ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '15.9.е',
	sign 	: '5.48',
	type 	: 'stop',
},







{ 
	id 		: 'crossroads', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив зупинку ближче 10 м від краю перехрещуваної проїзної частини перехрестя',
	descr 	: 'ЗУПИНКА на ПЕРЕХРЕСТІ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '15.9.ґ',
	type 	: 'stop',
},
{ 
	id 		: 'territory_adjacent', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснив зупинку ближче 10 м від виїзду з прилеглої території',
	descr 	: 'ЗУПИНКА на ВИЇЗДІ з ПРИЛЕГЛИХ ТЕРИТОРІЙ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '15.9.и',
	type 	: 'stop',
},
{ 
	id 		: 'light_left_no', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'на якому не горіла лампа лівої фари в режимі ближнього світла, здійснював рух в темну пору доби', 
	descr 	: 'ЛІВА ФАРА', 
	kupap 	: { id: '121_1', art: '121', part: '1', },
	pdr 	: '31.4.3.в',
	type 	: 'move',
},
{ 
	id 		: 'light_night_no', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'на якому не горіли фари ближнього світла, здійснював рух в темну пору доби', 
	descr 	: 'БЛИЖНІ ФАРИ в ТЕМНУ ПОРУ ДОБИ',
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '19.1.а',
	type 	: 'move',
},
{ 
	id 		: 'minibus', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'який використовується для надання послуг з перевезення пасажирів та на якому не горіла лампа лівої фари в режимі ближнього світла, здійснював рух в темну пору доби', 
	descr 	: 'ЛІВА ФАРА,  МАРШРУТНІ ТЗ', 
	kupap 	: { id: '121_2', art: '121', part: '2', },
	pdr 	: '31.4.3.в',
	type 	: 'move',
},
{ 
	id 		: 'turn_signal_no_a', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не подав сигнал світловими покажчиками повороту відповідного напрямку перед  ( --початком руху,  --зупинкою )', 
	descr 	: 'ПОВОРОТНИКИ, ПОЧАТОК РУХУ, ЗУПИНКА',
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '9.2.а',
	type 	: 'move',
},
{ 
	id 		: 'turn_signal_no_b', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не подав сигнал світловими покажчиками повороту відповідного напрямку перед  ( --перестроюванням,  --поворотом,  --розворотом )', 
	descr 	: 'ПОВОРОТНИКИ, ЗМІНА НАПРЯМКУ',
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '9.2.б',
	type 	: 'move',
},
{ 
	id 		: 'solid_double', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'перетнув подвійну суцільну лінію дорожньої горизонтальної розмітки, яка поділяє транспортні потоки протилежних напрямків', 
	descr 	: 'ПОДВІЙНА СУЦІЛЬНА',
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '34.1',
	marking : '1.3',
	type 	: 'move',
},
{ 
	id 		: 'pdr_11.4', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'на дорозі з двостороннім рухом, яка має ( --дві, --три, ) смуги для руху в одному напрямку, здійснив виїзд на призначений для зустрічного руху бік дороги', 
	descr 	: 'ВИЇЗД на ЗУСТРІЧНУ',
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '11.4',
	type 	: 'move',
},
{ 
	id 		: 'sidewalk_move', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснював рух по тротуару',
	descr 	: 'РУХ по ТРОТУАРАХ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '11.13',
	type 	: 'move',
},
{ 
	id 		: 'sidewalk_stop', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснював стоянку на тротуарі, де для руху пішоходів залишалося менше 2 м',
	descr 	: 'СТОЯНКА на ТРОТУАРІ',
	kupap 	: { art: '122', part: '1', },
	pdr 	: '15.10.в',
	type 	: 'stop',
},
{ 
	id 		: 'belt', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'під час руху не був пристебнутий ременем безпеки',
	descr 	: 'РЕМІНЬ',
	kupap 	: { art: '121', part: '5', },
	pdr 	: '2.3.в',
	type 	: 'move',
},
{ 
	id 		: 'helmet', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'під час руху не був в мотошоломі',
	descr 	: 'ШОЛОМ',
	kupap 	: { art: '121', part: '5', },
	pdr 	: '2.3.г',
	type 	: 'move',
},
{ 
	id 		: 'mobile', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'під час руху користувався засобами зв’язку, тримаючи їх у руці',
	descr 	: 'МОБІЛЬНИЙ ТЕЛЕФОН',
	kupap 	: { art: '122', part: '2', },
	pdr 	: '2.9.д',
	type 	: 'move',
},
{ 
	id 		: 'dnz_mud', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'з забрудненим номерним знаком, що не дає змоги чітко визначити символи знака з відстані 20 м, здійснював рух в темну пору доби',
	descr 	: 'БРУДНИЙ НОМЕР',
	kupap 	: { art: '121-3', part: '1', },
	pdr 	: '2.9.в',
	type 	: 'move',
},
{ 
	id 		: 'dnz_light_no', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'з неосвітленим номерним знаком, здійснював рух ( --у темну пору доби, --в умовах недостатньої видимості )',
	descr 	: 'НЕОСВІТЛЕНИЙ НОМЕР',
	kupap 	: { art: '121-3', part: '1', },
	pdr 	: '2.9.в',
	type 	: 'move',
},





{ 
	id 		: 'doc_license_no_rights', img: 'doc_license', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснював рух, не маючи права керування таким ТЗ',
	descr 	: 'ПВ, НЕ МАЄ ПРАВА, ніколи не було',
	kupap 	: { art: '126', part: '2', },
	pdr 	: '2.1.а',
	type 	: 'doc',
},
{ 
	id 		: 'doc_license_no_paper', img: 'doc_license', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не мав при собі посвідчення водія на право керування ТЗ відповідної категорії',
	descr 	: 'ПВ, НЕ МАВ при СОБІ',
	kupap 	: { art: '126', part: '1', },
	pdr 	: '2.1.а',
	type 	: 'doc',
},
{ 
	id 		: 'doc_license_deprived', img: 'doc_license', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'здійснював рух, будучи позбавленим права керування транспортними засобами',
	descr 	: 'ПВ, ПОЗБАВЛЕНИЙ',
	kupap 	: { art: '126', part: '4', },
	pdr 	: '2.1.а',
	type 	: 'doc',
},
{ 
	id 		: 'doc_registration', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не мав при собі реєстраційного документа на транспортний засіб',
	descr 	: 'СВІДОЦТВО',
	kupap 	: { art: '126', part: '1', },
	pdr 	: '2.1.б',
	type 	: 'doc',
},
{ 
	id 		: 'doc_policy', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'не мав при собі поліса обов’язкового страхування цивільно-правової відповідальності власників наземних ТЗ',
	descr 	: 'СТРАХОВКА',
	kupap 	: { art: '126', part: '1', },
	pdr 	: '2.1.ґ',
	type 	: 'doc',
},





{ 
	id 		: 'pedestrian_signal_red', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'перейшов проїзну частину на заборонений червоний сигнал світлофора',
	descr 	: 'ПЕРЕХІД на ЧЕРВОНИЙ',
	kupap 	: { art: '127', part: '1', },
	pdr 	: '8.7.7',
	type 	: 'pedestrian',
},
{ 
	id 		: 'pedestrian_crosswalk', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: 'перейшов проїзну частину у невстановленому місті, поза пішохідним переходом',
	descr 	: 'ПЕРЕХІД в НЕВСТАНОВЛЕНИХ МІСЦЯХ',
	kupap 	: { art: '127', part: '1', },
	pdr 	: '4.7',
	type 	: 'pedestrian',
},















/* 	Громадська безпека 
{ 
	id 		: 'pedestrian_railroad', edit: { d: '08', m: '10', y: '2023', }, 
	fabula 	: '',
	descr 	: 'ЗАЛІЗНИЦЯ',
	kupap 	: { art: '109', part: '3', },
	pdr 	: '',
	type 	: 'pedestrian',
},
*/










];














/*
let objListAny = {};
arrListAny.forEach( k => {
	objListAny[ k.id ] = k;
});
*/






