// https://zakon.rada.gov.ua/laws/show/2341-14#Text






const arrListSheriffKku = [




/*
{ 
	id: 'kku_', art: '', title: '', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n ',
	parts: [
		{
			act: '',
			sanction: '',
		},

	],
},
*/



{ 
	id: 'kku_115', a: '115', title: 'Умисне вбивство.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n745',
	descr: `
		<p>1. Вбивство, тобто умисне протиправне заподіяння смерті іншій людині, -</p>
			<p class="sanction">карається позбавленням волі на строк від семи до п\'ятнадцяти років.</p>
		
		<p>2. Умисне вбивство:</p>
			<p>1) двох або більше осіб;</p>
			<p>2) малолітньої дитини або жінки, яка завідомо для винного перебувала у стані вагітності;</p>
			<p>3) заручника або викраденої людини;</p>
			<p>4) вчинене з особливою жорстокістю;</p>
			<p>5) вчинене способом, небезпечним для життя багатьох осіб;</p>
			<p>6) з корисливих мотивів;</p>
			<p>7) з хуліганських мотивів;</p>
			<p>8) особи чи її близького родича у зв'язку з виконанням цією особою службового або громадського обов'язку;</p>
			<p>9) з метою приховати інше кримінальне правопорушення або полегшити його вчинення;</p>
			<p>10) поєднане із зґвалтуванням або сексуальним насильством;</p>
			<p>11) вчинене на замовлення;</p>
			<p>12) вчинене за попередньою змовою групою осіб;</p>
			<p>13) вчинене особою, яка раніше вчинила умисне вбивство, за винятком вбивства, передбаченого статтями 116-118 цього Кодексу;</p>
			<p>14) з мотивів расової, національної чи релігійної нетерпимості, -,</p>

			<p class="sanction">карається позбавленням волі на строк від десяти до п\'ятнадцяти років або довічним позбавленням волі, з конфіскацією майна у випадку, передбаченому пунктом 6 частини другої цієї статті.</p>

	`,
},
{ 
	id: 'kku_126_1', a: '126-1', title: 'Домашнє насильство.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n3426',
	descr: `
		<p>Домашнє насильство, тобто умисне систематичне вчинення фізичного, психологічного або економічного насильства щодо подружжя чи колишнього подружжя або іншої особи, з якою винний перебуває (перебував) у сімейних або близьких відносинах, що призводить до фізичних або психологічних страждань, розладів здоров’я, втрати працездатності, емоційної залежності або погіршення якості життя потерпілої особи, -</p>
			<p class="sanction">карається громадськими роботами на строк від ста п’ятдесяти до двохсот сорока годин, або арештом на строк до шести місяців, або обмеженням волі на строк до п’яти років, або позбавленням волі на строк до двох років.</p>
	`,

},
{ 
	id: 'kku_129', a: '129', title: 'Погроза вбивством.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n825',
	descr: `
		<p>1. Погроза вбивством, якщо були реальні підстави побоюватися здійснення цієї погрози, -</p>
			<p class="sanction">карається арештом на строк до шести місяців або обмеженням волі на строк до двох років.</p>
		<p>2. Те саме діяння, вчинене членом організованої групи або з мотивів расової, національної чи релігійної нетерпимості, -</p>
			<p class="sanction">карається позбавленням волі на строк від трьох до п\'яти років.</p>
	`,
},
{ 
	id: 'kku_152', a: '152', title: 'Зґвалтування.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n976',
	descr: `
		<p>1. Вчинення дій сексуального характеру, пов’язаних із вагінальним, анальним або оральним проникненням в тіло іншої особи з використанням геніталій або будь-якого іншого предмета, без добровільної згоди потерпілої особи (зґвалтування) -</p>
			<p class="sanction">карається позбавленням волі на строк від трьох до п’яти років.</p>
		<p>2. Зґвалтування, вчинене повторно або особою, яка раніше вчинила будь-яке із кримінальних правопорушень, передбачених статтями 153-155 цього Кодексу, або вчинення таких діянь щодо подружжя чи колишнього подружжя або іншої особи, з якою винний перебуває (перебував) у сімейних або близьких відносинах, або щодо особи у зв’язку з виконанням цією особою службового, професійного чи громадського обов’язку, або щодо жінки, яка завідомо для винного перебувала у стані вагітності, -</p>
			<p class="sanction">карається позбавленням волі на строк від п’яти до десяти років.</p>
		<p>3. Зґвалтування, вчинене групою осіб, або зґвалтування неповнолітньої особи -</p>
			<p class="sanction">карається позбавленням волі на строк від семи до дванадцяти років.</p>
		<p>4. Дії, передбачені частиною першою цієї статті, вчинені щодо особи, яка не досягла чотирнадцяти років, незалежно від її добровільної згоди, -</p>
			<p class="sanction">караються позбавленням волі на строк від десяти до п’ятнадцяти років.</p>
		<p>5. Дії, передбачені частинами першою, другою або третьою цієї статті, що спричинили тяжкі наслідки, -</p>
			<p class="sanction">караються позбавленням волі на строк від десяти до п’ятнадцяти років.</p>
		<p>6. Дії, передбачені частиною четвертою цієї статті, вчинені повторно або особою, яка раніше вчинила будь-який із злочинів, передбачених частинами четвертою або п’ятою статті 153, статтею 155 або частиною другою статті 156 цього Кодексу, -</p>
			<p class="sanction">караються позбавленням волі на строк п’ятнадцять років або довічним позбавленням волі.</p>
		<p><b>Примітка:</b> Згода вважається добровільною, якщо вона є результатом вільного волевиявлення особи, з урахуванням супутніх обставин.</p>
	`,
},
{ 
	id: 'kku_185', a: '185', title: 'Крадіжка.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n1209',
	descr: `
		<p>1. Таємне викрадення чужого майна (крадіжка) -</p>
			<p class="sanction">карається штрафом від однієї тисячі до трьох тисяч неоподатковуваних мінімумів доходів громадян або громадськими роботами на строк від вісімдесяти до двохсот сорока годин, або виправними роботами на строк до двох років, або арештом на строк до шести місяців, або обмеженням волі на строк до п’яти років.</p>
		<p>2. Крадіжка, вчинена повторно або за попередньою змовою групою осіб, -</p>
			<p class="sanction">карається арештом на строк від трьох до шести місяців або обмеженням волі на строк до п\'яти років або позбавленням волі на той самий строк.</p>
		<p>3. Крадіжка, поєднана з проникненням у житло, інше приміщення чи сховище або що завдала значної шкоди потерпілому, -</p>
			<p class="sanction">карається позбавленням волі на строк від трьох до шести років.</p>
		<p>4. Крадіжка, вчинена у великих розмірах чи в умовах воєнного або надзвичайного стану, -</p>
			<p class="sanction">карається позбавленням волі на строк від п\'яти до восьми років.</p>
		<p>5. Крадіжка, вчинена в особливо великих розмірах або організованою групою, -</p>
			<p class="sanction">карається позбавленням волі на строк від семи до дванадцяти років з конфіскацією майна.</p>
	`,
},
{ 
	id: 'kku_263', a: '263', title: 'Незаконне поводження зі зброєю, бойовими припасами або вибуховими речовинами.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n1780',
	descr: `
		<p>1. Носіння, зберігання, придбання, передача чи збут вогнепальної зброї (крім гладкоствольної мисливської), бойових припасів, вибухових речовин або вибухових пристроїв без передбаченого законом дозволу -</p>
			<p class="sanction">караються позбавленням волі на строк від трьох до семи років.</p>
		<p>2. Носіння, виготовлення, ремонт або збут кинджалів, фінських ножів, кастетів чи іншої холодної зброї без передбаченого законом дозволу -</p>
			<p class="sanction">караються штрафом від однієї тисячі до чотирьох тисяч неоподатковуваних мінімумів доходів громадян або громадськими роботами на строк від ста двадцяти до двохсот сорока годин, або арештом на строк від трьох до шести місяців, або обмеженням волі на строк від двох до п\'яти років, або позбавленням волі на строк до трьох років.</p>
		<p>3. Не підлягає кримінальній відповідальності за вчинення дій, передбачених частиною першою або другою цієї статті, особа, яка добровільно здала органам влади зброю, бойові припаси, вибухові речовини або вибухові пристрої.</p>
	`,
},
{ 
	id: 'kku_289', a: '289', title: 'Незаконне заволодіння транспортним засобом.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n1978',
	descr: `
		<p>1. Незаконне заволодіння транспортним засобом -</p>
			<p class="sanction">карається обмеженням волі на строк від трьох до п’яти років або позбавленням волі на той самий строк;</p>
		<p>2. Ті самі дії, вчинені повторно або за попередньою змовою групою осіб, або поєднані з насильством, що не є небезпечним для життя чи здоров\'я потерпілого, або з погрозою застосування такого насильства, або вчинені з проникненням у приміщення чи інше сховище, або з використанням електронних пристроїв для втручання в роботу технічних засобів охорони, або якщо предметом незаконного заволодіння є транспортний засіб, вартість якого становить від ста до двохсот п’ятдесяти неоподатковуваних мінімумів доходів громадян, -</p>
			<p class="sanction">караються позбавленням волі на строк від п\'яти до восьми років з конфіскацією майна або без такої.</p>
		<p>3. Дії, передбачені частинами першою або другою цієї статті, вчинені організованою групою або поєднані з насильством, небезпечним для життя чи здоров\'я потерпілого, або з погрозою застосування такого насильства, або якщо предметом незаконного заволодіння є транспортний засіб, вартість якого у двісті п’ятдесят і більше разів перевищує неоподатковуваний мінімум доходів громадян, -</p>
			<p class="sanction">караються позбавленням волі на строк від восьми до дванадцяти років з конфіскацією майна або без такої;</p>
		<p>4. Звільняється від кримінальної відповідальності судом особа, яка вперше вчинила дії, передбачені частиною першою цієї статті, та добровільно заявила про це правоохоронним органам, повернула транспортний засіб власнику і повністю відшкодувала завдані збитки.</p>
		<p><b>Примітка.</b>
			<br/>1. Під незаконним заволодінням транспортним засобом у цій статті слід розуміти вчинене умисно, з будь-якою метою протиправне вилучення будь-яким способом транспортного засобу у власника чи користувача всупереч їх волі.
			<br/>2. Відповідно до частини другої цієї статті під повторністю слід розуміти вчинення таких дій особою, яка раніше вчинила незаконне заволодіння транспортним засобом або кримінальне правопорушення, передбачене статтями 185, 186, 187, 189-191, 262, 290, 410 цього Кодексу.
		</p>
	`,
},
{ 
	id: 'kku_299', a: '299', title: 'Жорстоке поводження з тваринами.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n2063',
	descr: `
		<p>1. Жорстоке поводження з тваринами, що належать до хребетних, у тому числі з безпритульними тваринами, порушення правил транспортування тварин, якщо такі дії призвели до тілесних ушкоджень, каліцтва чи загибелі тварини, нацьковування тварин одна на одну, вчинене з хуліганських чи корисливих мотивів, а також пропаганда, публічні заклики до вчинення дій, що мають ознаки жорстокого поводження з тваринами, поширення матеріалів із закликами до вчинення таких дій -</p>
			<p class="sanction">караються обмеженням волі на строк від одного до трьох років або позбавленням волі на строк від двох до трьох років з конфіскацією тварини.</p>
		<p>2. Ті самі дії, вчинені у присутності малолітнього чи неповнолітнього, -</p>
			<p class="sanction">караються позбавленням волі на строк від трьох до п’яти років з конфіскацією тварини.</p>
		<p>3. Дії, передбачені частиною першою або другою цієї статті, вчинені з особливою жорстокістю або щодо двох і більше тварин, або повторно, або групою осіб, або вчинені активним способом, або насильницькі дії щодо тварини, спрямовані на задоволення статевої пристрасті, -</p>
			<p class="sanction">караються позбавленням волі на строк від п’яти до восьми років з конфіскацією тварини.</p>
		<p>4. Дії, передбачені частинами першою, другою або третьою цієї статті, вчинені з метою створення зображень, творів, кіно-, відео-, аудіопродукції, або збут чи поширення зображень, творів, кіно-, відео-, аудіопродукції, що пропагують жорстоке поводження з тваринами, -</p>
			<p class="sanction">караються позбавленням волі на строк від п’яти до восьми років з конфіскацією тварини.</p>
	`,
},
{ 
	id: 'kku_309', a: '309', title: 'Незаконне виробництво, виготовлення, придбання, зберігання, перевезення чи пересилання наркотичних засобів, психотропних речовин або їх аналогів без мети збуту.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n2147',
	descr: `
		<p>1. Незаконне виробництво, виготовлення, придбання, зберігання, перевезення чи пересилання наркотичних засобів, психотропних речовин або їх аналогів без мети збуту -</p>
			<p class="sanction">караються штрафом від однієї тисячі до трьох тисяч неоподатковуваних мінімумів доходів громадян або виправними роботами на строк до двох років, або арештом на строк до шести місяців, або обмеженням волі на строк до п’яти років.</p>
		<p>2. Ті самі дії, вчинені за попередньою змовою групою осіб чи протягом року після засудження за цією статтею або якщо предметом таких дій були наркотичні засоби, психотропні речовини або їх аналоги у великих розмірах, -</p>
			<p class="sanction">караються штрафом від двох тисяч до п’яти тисяч неоподатковуваних мінімумів доходів громадян або позбавленням волі на строк до трьох років.</p>
		<p>3. Дії, передбачені частинами першою або другою цієї статті, вчинені із залученням неповнолітнього, а також якщо предметом таких дій були наркотичні засоби, психотропні речовини або їх аналоги в особливо великих розмірах, -</p>
			<p class="sanction">караються позбавленням волі на строк від п\'яти до восьми років.</p>
		<p>4. Особа, яка добровільно звернулася до лікувального закладу і розпочала лікування від наркоманії, звільняється від кримінальної відповідальності за дії, передбачені частиною першою цієї статті.</p>
	`,
},
{ 
	id: 'kku_343', a: '343', title: 'Втручання в діяльність працівника правоохоронного органу, судового експерта, працівника державної виконавчої служби, приватного виконавця', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n2375',
	descr: `
		<p>1. Вплив у будь-якій формі на працівника правоохоронного органу, судового експерта, працівника органу державної виконавчої служби чи приватного виконавця, а також близького родича державного виконавця або приватного виконавця з метою перешкодити виконанню ним службових обов'язків, здійсненню судово-експертної діяльності або добитися прийняття незаконного рішення -</p>
			<p class="sanction">карається штрафом до ста неоподатковуваних мінімумів доходів громадян або виправними роботами на строк до одного року, або арештом на строк до трьох місяців.</p>
		<p>2. Ті самі дії, якщо вони перешкодили запобіганню кримінальному правопорушенню чи затриманню особи, яка його вчинила, або вчинені службовою особою з використанням свого службового становища, -</p>
			<p class="sanction">караються позбавленням права обіймати певні посади чи займатися певною діяльністю на строк до п'яти років або арештом на строк до шести місяців, або обмеженням волі на строк до чотирьох років.</p>
	`,
},
{ 
	id: 'kku_369', a: '369', title: 'Пропозиція, обіцянка або надання неправомірної вигоди службовій особі.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n2628',
	descr: `
		<p>1. Пропозиція чи обіцянка службовій особі надати їй або третій особі неправомірну вигоду, а так само надання такої вигоди за вчинення чи невчинення службовою особою в інтересах того, хто пропонує, обіцяє чи надає таку вигоду, чи в інтересах третьої особи будь-якої дії з використанням наданої їй влади чи службового становища -</p>
			<p>караються штрафом від однієї тисячі до чотирьох тисяч неоподатковуваних мінімумів доходів громадян або обмеженням волі на строк від двох до чотирьох років, або позбавленням волі на той самий строк.</p>
		<p>2. Діяння, передбачені частиною першою цієї статті, вчинені повторно, -</p>
			<p class="sanction">караються позбавленням волі на строк від трьох до шести років із штрафом від п’ятисот до однієї тисячі неоподатковуваних мінімумів доходів громадян, з конфіскацією майна або без такої.</p>
		<p>3. Діяння, передбачені частиною першою або другою цієї статті, якщо неправомірна вигода надавалася службовій особі, яка займає відповідальне становище, або вчинені за попередньою змовою групою осіб, -</p>
			<p class="sanction">караються позбавленням волі на строк від чотирьох до восьми років з конфіскацією майна або без такої.</p>
		<p>4. Діяння, передбачені частиною першою, другою або третьою цієї статті, якщо неправомірна вигода надавалася службовій особі, яка займає особливо відповідальне становище, або вчинені організованою групою осіб чи її учасником, -</p>
			<p>караються позбавленням волі на строк від п’яти до десяти років з конфіскацією майна або без такої.</p>
	`,
},
{ 
	id: 'kku_383', a: '383', title: 'Завідомо неправдиве повідомлення про вчинення кримінального правопорушення.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n2739',
	descr: `
		<p>1. Завідомо неправдиве повідомлення суду, прокурору, слідчому, дізнавачу або органу досудового розслідування про вчинення кримінального правопорушення -</p>
			<p class="sanction">карається виправними роботами на строк до двох років або арештом на строк до шести місяців, або обмеженням волі на строк до трьох років, або позбавленням волі на строк до двох років.</p>
		<p>2. Ті самі дії, поєднані з обвинуваченням особи в тяжкому чи особливо тяжкому злочині або із штучним створенням доказів обвинувачення, а також вчинені з корисливих мотивів, -</p>
			<p class="sanction">караються обмеженням волі на строк від двох до п\'яти років або позбавленням волі на той самий строк.</p>
	`,
},
{ 
	id: 'kku_384', a: '384', title: 'Введення в оману суду або іншого уповноваженого органу.', href: 'https://zakon.rada.gov.ua/laws/show/2341-14#n2745',
	descr: `
		<p>1. Завідомо неправдиве показання свідка, потерпілого, завідомо неправдивий висновок експерта, спеціаліста, складені для надання або надані органу, що здійснює досудове розслідування, виконавче провадження, суду, Вищій раді правосуддя, тимчасовій слідчій чи спеціальній тимчасовій слідчій комісії Верховної Ради України, подання завідомо недостовірних або підроблених доказів, завідомо неправдивий звіт оцінювача про оцінку майна, а також завідомо неправильний переклад, зроблений перекладачем у таких самих випадках, -</p>
			<p class="sanction">караються виправними роботами на строк до двох років або арештом на строк до шести місяців, або обмеженням волі на строк до двох років.</p>
		<p>2. Ті самі дії, поєднані з обвинуваченням у тяжкому чи особливо тяжкому злочині, або зі штучним створенням доказів обвинувачення чи захисту, а також вчинені з корисливих мотивів, -</p>
			<p class="sanction">караються виправними роботами на строк до двох років або обмеженням волі на строк до п\'яти років, або позбавленням волі на строк від двох до п\'яти років.</p>
	`,
},



];






let objListSheriffKku = {};
arrListSheriffKku.forEach( k => {
	objListSheriffKku[ k.id ] = k;
});







