

// a b v g kg d e ye zh z i yi k l m n o p r s t u f h c ch sh sch 6 yu ya 



// chapter 		- розділ
// part  		- частина
// paragraph 	- пункт
// item 		- подпункт



// p1
// p2
// p3
// p4
// p5
// p6
// p7

/*
а, б, в, г, ґ, д, е, є, ж, з, и, і, ї, й, к, л, м, н, о, п, р, с, т, у, ф, х, ц, ч, ш, щ, ь, ю, я
1  2  3  4  5  6  7  8  9  10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33
*/


const arrListSheriffPdr = [



	{
		id: 'pdr_c2_a1_p1',
		txt: { 
			pdr_n: '2.1.а', pdr_title: 'посвідчення водія на право керування транспортним засобом відповідної категорії;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n122',
		},
	},
	{
		id: 'pdr_c2_a1_p2',
		txt: { 
			pdr_n: '2.1.б', pdr_title: 'реєстраційний документ на транспортний засіб',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n124',
		},
	},
	{
		id: 'pdr_c2_a1_p5',
		txt: { 
			pdr_n: '2.1.ґ', pdr_title: 'чинний страховий поліс',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n129',
		},
	},
	{
		id: 'pdr_c2_a2',
		txt: { 
			pdr_n: '2.2', pdr_title: 'Власник транспортного засобу, а також особа, яка використовує такий транспортний засіб на законних підставах, можуть передавати керування транспортним засобом іншій особі, що має при собі посвідчення водія на право керування транспортним засобом відповідної категорії.',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n131',
		},
	},
	{
		id: 'pdr_c2_a3_p3',
		txt: { 
			pdr_n: '2.3.в', pdr_title: 'на автомобілях, обладнаних засобами пасивної безпеки (підголовники, ремені безпеки), користуватися ними і не перевозити пасажирів, не пристебнутих ременями безпеки. Дозволяється не пристібатися в населених пунктах водіям і пасажирам з інвалідністю, фізіологічні особливості яких унеможливлюють користування ременями безпеки, водіям і пасажирам оперативних та спеціальних транспортних засобів;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n137',
		},
	},
	{
		id: 'pdr_c2_a3_p4',
		txt: { 
			pdr_n: '2.3.г', pdr_title: 'під час руху на мотоциклі і мопеді бути в застебнутому мотошоломі і не перевозити пасажирів без застебнутих мотошоломів;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n138',
		},
	},
	{
		id: 'pdr_c2_a5',
		txt: { 
			pdr_n: '2.5', pdr_title: 'Водій повинен на вимогу поліцейського пройти в установленому порядку медичний огляд з метою встановлення стану алкогольного, наркотичного чи іншого сп’яніння або перебування під впливом лікарських препаратів, що знижують увагу та швидкість реакції.',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n161',
		},
	},
	{
		id: 'pdr_c2_a9_p1',
		txt: { 
			pdr_n: '2.9.а', pdr_title: 'керувати транспортним засобом у стані алкогольного, наркотичного чи іншого сп’яніння або перебування під впливом лікарських препаратів, що знижують увагу та швидкість реакції;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n170',
		},
	},



	{
		id: 'pdr_c2_a9_p4',
		txt: { 
			pdr_n: '2.9.г', pdr_title: 'передавати керування транспортним засобом особам, які перебувають у стані алкогольного, наркотичного чи іншого сп’яніння або під впливом лікарських препаратів, що знижують увагу та швидкість реакції, у хворобливому стані;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n179',
		},
	},










	{
		id: 'pdr_c2_a9_p5',
		txt: { 
			pdr_n: '2.9.ґ', pdr_title: 'передавати керування транспортним засобом особам, які не мають при собі посвідчення на право керування ним, якщо це не стосується навчання водінню відповідно до вимог розділу 24 цих Правил;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n180',
		},
	},














	{
		id: 'pdr_c2_a9_p3',
		txt: { 
			pdr_n: '2.9.в', pdr_title: 'керувати транспортним засобом, не зареєстрованим в уповноваженому органі МВС, або таким, що не пройшов відомчу реєстрацію в разі, якщо законом встановлена обов’язковість її проведення, а також без номерного знака або з номерним знаком, що:',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n172',
		},
	},
	{
		id: 'pdr_c2_a9_p6',
		txt: { 
			pdr_n: '2.9.д', pdr_title: 'під час руху транспортного засобу користуватися засобами зв\'язку, тримаючи їх у руці (за винятком водіїв оперативних транспортних засобів під час виконання ними невідкладного службового завдання);',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n181',
		},
	},
	{
		id: 'pdr_c4_a7',
		txt: { 
			pdr_n: '4.7', pdr_title: 'Пішоходи повинні переходити проїзну частину по пішохідних переходах, у тому числі підземних і надземних, а у разі їх відсутності — на перехрестях по лініях тротуарів або узбіч.',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n250',
		},
	},
	{
		id: 'pdr_c8_a4_p2_sign_2_1',
		txt: { 
			pdr_n: '8.4.б', pdr_title: 'знаки пріоритету. Встановлюють черговість проїзду перехресть, перехрещень проїзних частин або вузьких ділянок дороги;',
			sign_n: '2.1', sign_title: 'Дати дорогу', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n333',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/2.1',
		},
	},
	{
		id: 'pdr_c8_a4_p2_sign_2_2',
		txt: { 
			pdr_n: '8.4.б', pdr_title: 'знаки пріоритету. Встановлюють черговість проїзду перехресть, перехрещень проїзних частин або вузьких ділянок дороги;',
			sign_n: '2.2', sign_title: 'Проїзд без зупинки заборонено', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n333',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/2.2',
		},
	},
	{
		id: 'pdr_c8_a4_p2_sign_2_5',
		txt: { 
			pdr_n: '8.4.б', pdr_title: 'знаки пріоритету. Встановлюють черговість проїзду перехресть, перехрещень проїзних частин або вузьких ділянок дороги;',
			sign_n: '2.5', sign_title: 'Перевага зустрічного руху', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n333',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/2.5',
		},
	},
	{
		id: 'pdr_c8_a4_p3',
		txt: { 
			pdr_n: '8.4.в', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334',
		},
	},
		{
			id: 'pdr_c8_a4_p3_sign_3_1',
			txt: { 
				pdr_n: '8.4.в', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
				sign_n: '3.1', sign_title: 'Рух заборонено', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.1',
			},
		},
		{
			id: 'pdr_c8_a4_p3_sign_3_2',
			txt: { 
				pdr_n: '8.4.в', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
				sign_n: '3.2', sign_title: 'Рух механічних транспортних засобів заборонено', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.2',
			},
		},
		{
			id: 'pdr_c8_a4_p3_sign_3_21',
			txt: { 
				pdr_n: '8.4.в', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
				sign_n: '3.21', sign_title: 'В\'їзд заборонено', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.21',
			},
		},
		{
			id: 'pdr_c8_a4_p3_sign_3_22',
			txt: { 
				pdr_n: '8.4.в', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
				sign_n: '3.22', sign_title: 'Поворот праворуч заборонено', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.22',
			},
		},
		{
			id: 'pdr_c8_a4_p3_sign_3_25',
			txt: { 
				pdr_n: '8.4.в', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
				sign_n: '3.25', sign_title: 'Обгін заборонено', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.25',
			},
		},
		{
			id: 'pdr_c8_a4_p3_sign_3_34',
			txt: { 
				pdr_n: '8.4.в', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
				sign_n: '3.34', sign_title: 'Зупинку заборонено', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.34',
			},
		},
		{
			id: 'pdr_c8_a4_p3_sign_3_35',
			txt: { 
				pdr_n: '8.4.в', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
				sign_n: '3.35', sign_title: 'Стоянку заборонено', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.35',
			},
		},
		{
			id: 'pdr_c8_a4_p3_sign_3_41',
			txt: { 
				pdr_n: '8.4.в', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
				sign_n: '3.41', sign_title: 'Контроль', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.41',
			},
		},

	{
		id: 'pdr_c8_a4_p4',
		txt: { 
			pdr_n: '8.4.г', pdr_title: 'наказові знаки. Показують обов\'язкові напрямки руху або дозволяють деяким категоріям учасників рух по проїзній частині чи окремих її ділянках, а також запроваджують або скасовують деякі обмеження;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n335',
		},
	},
		{
			id: 'pdr_c8_a4_p4_sign_4_1',
			txt: { 
				pdr_n: '8.4.г', pdr_title: 'наказові знаки. Показують обов\'язкові напрямки руху або дозволяють деяким категоріям учасників рух по проїзній частині чи окремих її ділянках, а також запроваджують або скасовують деякі обмеження;',
				sign_n: '4.1', sign_title: 'Рух прямо', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n335',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.1',
			},
		},
		{
			id: 'pdr_c8_a4_p4_sign_4_2',
			txt: { 
				pdr_n: '8.4.г', pdr_title: 'наказові знаки. Показують обов\'язкові напрямки руху або дозволяють деяким категоріям учасників рух по проїзній частині чи окремих її ділянках, а також запроваджують або скасовують деякі обмеження;',
				sign_n: '4.2', sign_title: 'Рух праворуч', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n335',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.2',
			},
		},
		{
			id: 'pdr_c8_a4_p4_sign_4_5',
			txt: { 
				pdr_n: '8.4.г', pdr_title: 'наказові знаки. Показують обов\'язкові напрямки руху або дозволяють деяким категоріям учасників рух по проїзній частині чи окремих її ділянках, а також запроваджують або скасовують деякі обмеження;',
				sign_n: '4.5', sign_title: 'Рух прямо або ліворуч', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n335',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.5',
			},
		},
		{
			id: 'pdr_c8_a4_p4_sign_4_6',
			txt: { 
				pdr_n: '8.4.г', pdr_title: 'наказові знаки. Показують обов\'язкові напрямки руху або дозволяють деяким категоріям учасників рух по проїзній частині чи окремих її ділянках, а також запроваджують або скасовують деякі обмеження;',
				sign_n: '4.6', sign_title: 'Рух праворуч або ліворуч', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n335',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.6',
			},
		},
		{
			id: 'pdr_c8_a4_p4_sign_4_7',
			txt: { 
				pdr_n: '8.4.г', pdr_title: 'наказові знаки. Показують обов\'язкові напрямки руху або дозволяють деяким категоріям учасників рух по проїзній частині чи окремих її ділянках, а також запроваджують або скасовують деякі обмеження;',
				sign_n: '4.7', sign_title: 'Об’їзд перешкоди з правого боку', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n335',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.7',
			},
		},

	{
		id: 'pdr_c8_a4_p5',
		txt: { 
			pdr_n: '8.4.ґ', pdr_title: 'інформаційно-вказівні знаки. Запроваджують або скасовують певний режим руху, а також інформують учасників дорожнього руху про розташування населених пунктів, різних об\'єктів, територій, де діють спеціальні правила;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n336',
		},
	},
		{
			id: 'pdr_c8_a4_p5_sign_5_16',
			txt: { 
				pdr_n: '8.4.ґ', pdr_title: 'інформаційно-вказівні знаки. Запроваджують або скасовують певний режим руху, а також інформують учасників дорожнього руху про розташування населених пунктів, різних об\'єктів, територій, де діють спеціальні правила;',
				sign_n: '5.16', sign_title: 'Напрямки руху по смугах', 
			}, 
			href: {
				pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n336',
				sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.16',
			},
		},

	{
		id: 'pdr_c8_a5_p1_mark_c1_a1',
		txt: { 
			pdr_n: '8.5.1', pdr_title: 'Горизонтальна дорожня розмітка встановлює певний режим і порядок руху. Наноситься на проїзній частині або по верху бордюру у вигляді ліній, стрілок, написів, символів тощо фарбою чи іншими матеріалами відповідного кольору згідно з пунктом 1 розділу 34 цих Правил.',
			mark_n: '1.1', mark_title: 'Вузька суцільна лінія', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n340',
			mark: 'https://pdr.infotech.gov.ua/theory/road-markings/1.1',
		},
	},
	{
		id: 'pdr_c8_a5_p1_mark_c1_a3',
		txt: { 
			pdr_n: '8.5.1', pdr_title: 'Горизонтальна дорожня розмітка встановлює певний режим і порядок руху. Наноситься на проїзній частині або по верху бордюру у вигляді ліній, стрілок, написів, символів тощо фарбою чи іншими матеріалами відповідного кольору згідно з пунктом 1 розділу 34 цих Правил.',
			mark_n: '1.3', mark_title: 'Розмітка 1.3', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n340',
			mark: 'https://pdr.infotech.gov.ua/theory/road-markings/1.3',
		},
	},
	{
		id: 'pdr_c8_a5_p1_mark_c1_a12',
		txt: { 
			pdr_n: '8.5.1', pdr_title: 'Горизонтальна дорожня розмітка встановлює певний режим і порядок руху. Наноситься на проїзній частині або по верху бордюру у вигляді ліній, стрілок, написів, символів тощо фарбою чи іншими матеріалами відповідного кольору згідно з пунктом 1 розділу 34 цих Правил.',
			mark_n: '1.12', mark_title: 'Стоп-лінія', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n340',
			mark: 'https://pdr.infotech.gov.ua/theory/road-markings/1.12',
		},
	},
	{
		id: 'pdr_c8_a5_p1_mark_c1_a35',
		txt: { 
			pdr_n: '8.5.1', pdr_title: 'Горизонтальна дорожня розмітка встановлює певний режим і порядок руху. Наноситься на проїзній частині або по верху бордюру у вигляді ліній, стрілок, написів, символів тощо фарбою чи іншими матеріалами відповідного кольору згідно з пунктом 1 розділу 34 цих Правил.',
			mark_n: '1.35', mark_title: '', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n340',
			mark: 'https://pdr.infotech.gov.ua/theory/road-markings/1.35',
		},
	},
	{
		id: 'pdr_c8_a7_p3_i5',
		txt: { pdr_n: '8.7.3.ґ', pdr_title: 'жовтий забороняє рух і попереджає про наступну зміну сигналів;', }, 
		href: { pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n369', },
	},
	{
		id: 'pdr_c8_a7_p3_i7',
		txt: { pdr_n: '8.7.3.е', pdr_title: 'червоний сигнал, у тому числі миготливий, або два червоних миготливих сигнали забороняють рух', }, 
		href: { pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n371', },
	},
	{
		id: 'pdr_c8_a7_p3_i10',
		txt: { 
			pdr_n: '8.7.3.з', pdr_title: 'вимкнений сигнал додаткової секції забороняє рух у напрямку, вказаному її стрілкою (стрілками).',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n377',
		},
	},



	{
		id: 'pdr_c8_a7_p7',
		txt: { 
			pdr_n: '8.7.7', pdr_title: '',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n389',
		},
	},
















	{
		id: 'pdr_c8_a8_p3',
		txt: { 
			pdr_n: '8.8.в', pdr_title: 'рука піднята вгору:',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n399',
		},
	},
	{
		id: 'pdr_c9_a2_p1',
		txt: { 
			pdr_n: '9.2.а', pdr_title: 'перед початком руху і зупинкою',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n422',
		},
	},
	{
		id: 'pdr_c9_a2_p2',
		txt: { 
			pdr_n: '9.2.б', pdr_title: 'перед перестроюванням, поворотом або розворотом',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n423',
		},
	},
	{
		id: 'pdr_c11_a4',
		txt: { 
			pdr_n: '11.4', pdr_title: 'На дорогах з двостороннім рухом, які мають щонайменше дві смуги для руху в одному напрямку, забороняється виїжджати на призначений для зустрічного руху бік дороги.',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n485',
		},
	},










	/*
	{
		id: '11.13', chapter: '11', part: '13',
		txt: [ 'Забороняється рух транспортних засобів по тротуарах і пішохідних доріжках, крім випадків, коли вони застосовуються для виконання робіт або обслуговування торговельних та інших підприємств, розташованих безпосередньо біля цих тротуарів або доріжок, за відсутності інших під\'їздів і за умови виконання вимог пунктів 26.1-26.3 цих Правил', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n497', 
	},
*/









	{
		id: 'pdr_c11_a13',
		txt: { 
			pdr_n: '11.13', pdr_title: 'На дорогах із двостороннім рухом, які мають по одній смузі для руху в кожному напрямку, за відсутності суцільної лінії дорожньої розмітки чи відповідних дорожніх знаків виїзд на смугу зустрічного руху можливий лише для обгону та об\'їзду перешкоди або зупинки чи стоянки біля лівого краю проїзної частини в населених пунктах у дозволених випадках, при цьому водії зустрічного напрямку мають перевагу.',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n497',
		},
	},
	{
		id: 'pdr_c12_a9_p2_sign_3_29_20',
		txt: { 
			pdr_n: '12.9.б', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
			sign_n: '3.29', sign_title: 'Обмеження максимальної швидкості', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n519',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.29',
		},
	},
	{
		id: 'pdr_c12_a9_p2_sign_3_29_50',
		txt: { 
			pdr_n: '12.9.б', pdr_title: 'заборонні знаки. Запроваджують або скасовують певні обмеження в русі;',
			sign_n: '3.29', sign_title: 'Обмеження максимальної швидкості', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n519',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.29',
		},
	},
	{
		id: 'pdr_c15_a4',
		txt: { 
			pdr_n: '15.4', 
			pdr_title: 'Транспортні засоби не дозволяється ставити на проїзній частині в два і більше ряди. Велосипеди, мопеди і мотоцикли без бокового причепа дозволяється ставити на проїзній частині не більше ніж у два ряди.',
		},		
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n568',
		},
	},
	{
		id: 'pdr_c15_a9_p4_sign_5_38_1',
		txt: { 
			pdr_n: '15.9.г', pdr_title: 'на пішохідних переходах і ближче 10 м від них з обох боків, крім випадків надання переваги в русі;',
			sign_n: '5.38.1', sign_title: 'Пішохідний перехід', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n580',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.38.1',
		},
	},
	{
		id: 'pdr_c15_a9_p5',
		txt: { 
			pdr_n: '15.9.ґ', pdr_title: 'на перехрестях та ближче 10 м від краю перехрещуваної проїзної частини за відсутності на них пішохідного переходу, за винятком зупинки для надання переваги в русі та зупинки проти бокового проїзду на Т-подібних перехрестях, де є суцільна лінія розмітки або розділювальна смуга;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n581',
		},
	},
	{
		id: 'pdr_c15_a9_p7_sign_5_45_1',
		txt: { 
			pdr_n: '15.9.е', pdr_title: 'ближче 30 м від посадкових майданчиків для зупинки маршрутних транспортних засобів, а коли їх немає - ближче 30 м від дорожнього знака такої зупинки з обох боків;',
			sign_n: '5.45.1', sign_title: 'Пункт зупинки автобуса', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n583',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.45.1',
		},
	},
	{
		id: 'pdr_c15_a9_p7_sign_5_46_1',
		txt: { 
			pdr_n: '15.9.е', pdr_title: 'ближче 30 м від посадкових майданчиків для зупинки маршрутних транспортних засобів, а коли їх немає - ближче 30 м від дорожнього знака такої зупинки з обох боків;',
			sign_n: '5.46.1', sign_title: 'Пункт зупинки трамвая', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n583',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.46.1',
		},
	},
	{
		id: 'pdr_c15_a9_p7_sign_5_47_1',
		txt: { 
			pdr_n: '15.9.е', pdr_title: 'ближче 30 м від посадкових майданчиків для зупинки маршрутних транспортних засобів, а коли їх немає - ближче 30 м від дорожнього знака такої зупинки з обох боків;',
			sign_n: '5.47.1', sign_title: 'Пункт зупинки тролейбуса', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n583',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.47.1',
		},
	},
	{
		id: 'pdr_c15_a9_p7_sign_5_48',
		txt: { 
			pdr_n: '15.9.е', pdr_title: 'ближче 30 м від посадкових майданчиків для зупинки маршрутних транспортних засобів, а коли їх немає - ближче 30 м від дорожнього знака такої зупинки з обох боків;',
			sign_n: '5.48', sign_title: 'Пункт зупинки таксі', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n583',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.48',
		},
	},
	{
		id: 'pdr_c15_a9_p11',
		txt: { 
			pdr_n: '15.9.и', pdr_title: 'ближче 10 м від виїздів з прилеглих територій і безпосередньо в місці виїзду.',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n587',
		},
	},
	{
		id: 'pdr_c15_a10_p3',
		txt: { 
			pdr_n: '15.10.в', pdr_title: 'на тротуарах, за винятком легкових автомобілів та мотоциклів, які можуть бути поставлені на краю тротуарів, де для руху пішоходів залишається щонайменше 2 м;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n591',
		},
	},
	{
		id: 'pdr_c17_a1_sign_5_8',
		txt: { 
			pdr_n: '17.1', pdr_title: 'На дорозі із смугою для маршрутних транспортних засобів, позначеній дорожнім знаком 5.8 або 5.11 забороняються рух і зупинка інших транспортних засобів (крім таксі та велосипедистів) на цій смузі.',
			sign_n: '5.8', sign_title: 'Дорога із смугою для руху маршрутних транспортних засобів', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n628',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.8',
		},
	},
	{
		id: 'pdr_c17_a1_sign_5_11',
		txt: { 
			pdr_n: '17.1', pdr_title: 'На дорозі із смугою для маршрутних транспортних засобів, позначеній дорожнім знаком 5.8 або 5.11 забороняються рух і зупинка інших транспортних засобів (крім таксі та велосипедистів) на цій смузі.',
			sign_n: '5.11', sign_title: 'Дорога із смугою для руху маршрутних транспортних засобів', 
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n628',
			sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.11',
		},
	},
	{
		id: 'pdr_c19_a1_p1',
		txt: { 
			pdr_n: '19.1.а', pdr_title: 'на всіх механічних транспортних засобах - фари ближнього (дальнього) світла',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n646',
		},
	},
	{
		id: 'pdr_c21_a11_p2',
		txt: { 
			pdr_n: '21.11.б', pdr_title: 'дітей, зріст яких менше 150 см, у транспортних засобах без використання дитячих утримуючих систем, що дають змогу пристебнути дитину за допомогою ременів безпеки, передбачених конструкцією цього транспортного засобу;',
		}, 
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n697',
		},
	},
	{
		id: 'pdr_c31_a1',
		txt: { 
			pdr_n: '31.1', 
			pdr_title: 'Технічний стан транспортних засобів та їх обладнання повинні відповідати вимогам стандартів, що стосуються безпеки дорожнього руху та охорони навколишнього середовища, а також правил технічної експлуатації, інструкцій підприємств-виробників та іншої нормативно-технічної документації.',
			dstu: { n: '3649:2010', item: '6.8.5', },
		},		
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n834',
			dstu: 'https://patrul.in.ua/pdf/dstu-3649.pdf',
		},
	},
	{
		id: 'pdr_c31_a4_p3_i3',
		txt: { 
			pdr_n: '31.4.3.в', 
			pdr_title: 'Не горить лампа лівої фари в режимі ближнього світла.',
		},		
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n866',
		},
	},
	{
		id: 'pdr_c31_a4_p7_i1',
		txt: { 
			pdr_n: '31.4.7.а', 
			pdr_title: 'немає передбачених конструкцією транспортного засобу стекол, дзеркал заднього виду;',
		},		
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n888',
		},
	},
	{
		id: 'pdr_c31_a4_p7_i7',
		txt: { 
			pdr_n: '31.4.7.е', 
			pdr_title: 'відсутній передбачений конструкцією бампер або задній захисний пристрій, грязезахисні фартухи і бризковики',
		},		
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n895',
		},
	},
	{
		id: 'pdr_c31_a6_p2',
		txt: { 
			pdr_n: '31.6.б', 
			pdr_title: 'у темну пору доби або в умовах недостатньої видимості не горять лампи фар чи задніх габаритних ліхтарів;',
		},		
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n914',
		},
	},
	{
		id: 'pdr_c31_a6_p3',
		txt: { 
			pdr_n: '31.6.в', 
			pdr_title: 'під час дощу або снігопаду не працює склоочисник з боку розміщення керма;',
		},		
		href: {
			pdr: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n915',
		},
	},









/*




{
	id: '1', chapter: '1',
	txt: [ 'Загальні положення', ],
},
	{
		id: '1.1', chapter: '1', part: '1',
		txt: [ 
			'Ці Правила відповідно до Закону України «Про дорожній рух» встановлюють єдиний порядок дорожнього руху на всій території України.', 
			'Інші нормативні акти, що стосуються особливостей дорожнього руху (перевезення спеціальних вантажів, експлуатація транспортних засобів окремих видів, рух на закритій території тощо), повинні ґрунтуватися на вимогах цих Правил.',
		],
	},
	{
		id: '1.2', chapter: '1', part: '2',
		txt: [ 'В Україні установлено правосторонній рух транспортних засобів.', ],
	},

{
	id: '2', chapter: '2',
	txt: [ 'Обов\'язки і права водіїв механічних транспортних засобів', ],
	href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n120', 
},
	{
		id: '2.1', chapter: '2', part: '1',
		txt: [ 'Водій механічного транспортного засобу повинен мати при собі:', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n121', 
	},
		{
			id: '2.1.а', chapter: '2', part: '1', paragraph: 'а',
			txt: [ 'посвідчення водія на право керування транспортним засобом відповідної категорії;', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n122', 
		},
		{
			id: '2.1.б', chapter: '2', part: '1', paragraph: 'б',
			txt: [ 'реєстраційний документ на транспортний засіб (для транспортних засобів Збройних Сил, Національної Гвардії, Держприкордонслужби, Держспецтрансслужби, Держспецзв’язку, Оперативно-рятувальної служби цивільного захисту — технічний талон);', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n124', 
		},
		{
			id: '2.1.в', chapter: '2', part: '1', paragraph: 'в',
			txt: [ 'у разі встановлення на транспортних засобах проблискових маячків та (або) спеціальних звукових сигнальних пристроїв — дозвіл, виданий уповноваженим органом МВС, а у разі встановлення проблискового маячка оранжевого кольору на великогабаритних та великовагових транспортних засобах — дозвіл, виданий уповноваженим підрозділом Національної поліції, крім випадків встановлення проблискових маячків оранжевого кольору на сільськогосподарській техніці, ширина якої перевищує 2,6 м;', ],
		},
		{
			id: '2.1.г', chapter: '2', part: '1', paragraph: 'г',
			txt: [ 'на маршрутних транспортних засобах — схему маршруту та розклад руху; на великовагових і великогабаритних транспортних засобах та транспортних засобах, що здійснюють дорожнє перевезення небезпечних вантажів — документацію відповідно до вимог спеціальних правил, що визначаються Європейською Угодою про міжнародне дорожнє перевезення небезпечних вантажів (далі — спеціальні правила) (пункт змінено 11.11.2020);', ],
		},
		{
			id: '2.1.ґ', chapter: '2', part: '1', paragraph: 'ґ',
			txt: [ 'чинний страховий поліс (страховий сертифікат «Зелена картка») про укладення договору обов’язкового страхування цивільно-правової відповідальності власників наземних транспортних засобів або чинний внутрішній електронний договір зазначеного виду обов’язкового страхування у візуальній формі страхового поліса (на електронному або паперовому носії), відомості про який підтверджуються інформацією, що міститься в єдиній централізованій базі даних, оператором якої є Моторне (транспортне) страхове бюро України. Водії, які відповідно до законодавства звільняються від обов’язкового страхування цивільно-правової відповідальності власників наземних транспортних засобів на території України, повинні мати при собі відповідні підтвердні документи (посвідчення);', ],
		},
		{
			id: '2.1.д', chapter: '2', part: '1', paragraph: 'д',
			txt: [ 'у разі встановлення на транспортному засобі розпізнавального знака “Водій з інвалідністю” - документ, що підтверджує інвалідність водія або пасажира (крім водіїв з явними ознаками інвалідності або водіїв, які перевозять пасажирів з явними ознаками інвалідності).', ],
		},

	{
		id: '2.2', chapter: '2', part: '2',
		txt: [ 
			'Власник транспортного засобу, а також особа, яка використовує такий транспортний засіб на законних підставах, можуть передавати керування транспортним засобом іншій особі, що має при собі посвідчення водія на право керування транспортним засобом відповідної категорії.', 
			'Власник транспортного засобу може передавати такий засіб у користування іншій особі, що має посвідчення водія на право керування транспортним засобом відповідної категорії, передавши їй реєстраційний документ на цей транспортний засіб.', 
		],
	},
	{
		id: '2.3', chapter: '2', part: '3',
		txt: [ 'Для забезпечення безпеки дорожнього руху водій зобов’язаний:', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n134', 
	},
		{
			id: '2.3.а', chapter: '2', part: '3', paragraph: 'а',
			txt: [ 'перед виїздом перевірити і забезпечити технічно справний стан і комплектність транспортного засобу, правильність розміщення та кріплення вантажу;', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n135', 
		},
		{
			id: '2.3.б', chapter: '2', part: '3', paragraph: 'б',
			txt: [ 'бути уважним, стежити за дорожньою обстановкою, відповідно реагувати на її зміну, стежити за правильністю розміщення та кріплення вантажу, технічним станом транспортного засобу і не відволікатися від керування цим засобом у дорозі;', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n136', 
		},
		{
			id: '2.3.в', chapter: '2', part: '3', paragraph: 'в',
			txt: [ 'на автомобілях, обладнаних засобами пасивної безпеки (підголовники, ремені безпеки), користуватися ними і не перевозити пасажирів, не пристебнутих ременями безпеки. Дозволяється не пристібатися в населених пунктах водіям і пасажирам з інвалідністю, фізіологічні особливості яких унеможливлюють користування ременями безпеки, водіям і пасажирам оперативних та спеціальних транспортних засобів;', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n137', 
		},
		{
			id: '2.3.г', chapter: '2', part: '3', paragraph: 'г',
			txt: [ '', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n138', 
		},


	{
		id: '2.9', chapter: '2', part: '9',
		txt: [ 'Водієві забороняється:', ],
		//href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n169', 
	},
		{
			id: '2.9.а', chapter: '2', part: '9', paragraph: 'а',
			txt: [ 'керувати транспортним засобом у стані алкогольного, наркотичного чи іншого сп’яніння або перебування під впливом лікарських препаратів, що знижують увагу та швидкість реакції;', ],
			//href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n170', 
		},

		{
			id: '2.9.г', chapter: '2', part: '9', paragraph: 'г',
			txt: [ 'передавати керування транспортним засобом особам, які перебувають у стані алкогольного, наркотичного чи іншого сп’яніння або під впливом лікарських препаратів, що знижують увагу та швидкість реакції, у хворобливому стані', ],
			//href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n179', 
		},
		{
			id: '2.9.д', chapter: '2', part: '9', paragraph: 'д',
			txt: [ 'під час руху транспортного засобу користуватися засобами зв\'язку, тримаючи їх у руці (за винятком водіїв оперативних транспортних засобів під час виконання ними невідкладного службового завдання)', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n181', 
		},

{
	id: '4', chapter: '4',
	txt: [ 'Обов\'язки і права пішоходів', ],
},


{
	id: '8', chapter: '8',
	txt: [ 'Регулювання дорожнього руху', ],
},
	{
		id: '8.4', chapter: '8', part: '4',
		txt: [ 'Дорожні знаки поділяються на групи:', ],
	},
		{
			id: '8.4.б', chapter: '8', part: '4', paragraph: 'б',
			txt: [ 'Знаки пріоритету. Встановлюють черговість проїзду перехресть, перехрещень проїзних частин або вузьких ділянок дороги.', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n333', 
		},
		{
			id: '8.4.в', chapter: '8', part: '4', paragraph: 'в',
			txt: [ 'Заборонні знаки. Запроваджують або скасовують певні обмеження в русі.', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n334', 
		},

		{
			id: '8.4.ґ', chapter: '8', part: '4', paragraph: 'ґ',
			txt: [ 'інформаційно-вказівні знаки. Запроваджують або скасовують певний режим руху, а також інформують учасників дорожнього руху про розташування населених пунктів, різних об\'єктів, територій, де діють спеціальні правила', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n336', 
		},

	{
		id: '8.7', chapter: '8', part: '7',
		txt: [ 
			'Світлофори призначені для регулювання руху транспортних засобів і пішоходів, мають світлові сигнали зеленого, жовтого, червоного і біло-місячного кольорів, які розташовані вертикально чи горизонтально. Сигнали світлофора можуть бути з нанесеною суцільною чи контурною стрілкою (стрілками), із силуетом пішохода, Х-подібні.', 
			'На рівні червоного сигналу світлофора із вертикальним розташуванням сигналів може встановлюватися табличка білого кольору із нанесеною на ній стрілкою зеленого кольору.', 
		],
	},
		{
			id: '8.7.3', chapter: '8', part: '7', paragraph: '3',
			txt: [ 'Сигнали світлофора мають такі значення:', ],
		},
			{
				id: '8.7.3.ґ', chapter: '8', part: '7', paragraph: '3', item: 'ґ',
				txt: [ 'Жовтий забороняє рух і попереджає про наступну зміну сигналів;', ],
				href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n369', 
			},
			{
				id: '8.7.3.e', chapter: '8', part: '7', paragraph: '3', item: 'е',
				txt: [ 
					'Червоний сигнал, у тому числі миготливий, або два червоних миготливих сигнали забороняють рух.', 
					'Сигнал у вигляді зеленої стрілки (стрілок) у додатковій (додаткових) секції разом з жовтим або червоним сигналом світлофора інформує водія про те, що рух дозволяється у вказаному напрямку за умови безперешкодного пропуску транспортних засобів, які рухаються з інших напрямків.', 
					'Стрілка зеленого кольору на табличці, встановленій на рівні червоного сигналу світлофора з вертикальним розташуванням сигналів, дозволяє рух у зазначеному напрямку при ввімкненому червоному сигналі світлофора з крайньої правої смуги руху (або крайньої лівої смуги руху на дорогах з одностороннім рухом) за умови надання переваги в русі іншим його учасникам, які рухаються з інших напрямків на сигнал світлофора, що дозволяє рух;', 
				],
				href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n371', 
			},
			{
				id: '8.7.3.з', chapter: '8', part: '7', paragraph: '3', item: 'з',
				txt: [ 'вимкнений сигнал додаткової секції забороняє рух у напрямку, вказаному її стрілкою (стрілками)', ],
				href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n377', 
			},
			{
				id: '8.7.7', chapter: '8', part: '7', paragraph: '7',
				txt: [ 'Якщо сигнал світлофора має вигляд силуету пішохода, його дія поширюється лише на пішоходів, при цьому зелений сигнал дозволяє рух, червоний - забороняє', ],
				href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n389', 
			},

	{
		id: '8.8', chapter: '8', part: '8',
		txt: [ 'Сигнали регулювальника. Сигналами регулювальника є положення його корпуса, а також жести руками, в тому числі з жезлом або диском з червоним світлоповертачем, які мають такі значення:', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n391', 
	},
		{
			id: '8.8.в', chapter: '8', part: '8', paragraph: 'в',
			txt: [ 
				'рука піднята вгору:', 
				'рух усіх транспортних засобів і пішоходів заборонено в усіх напрямках:', 
			],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n399', 
		},

{
	id: '9', chapter: '9',
	txt: [ 'Попереджувальні сигнали', ],
},
	{
		id: '9.2', chapter: '9', part: '2',
		txt: [ 'Водій повинен подавати сигнали світловими покажчиками повороту відповідного напрямку:', ],
	},





{
	id: '11', chapter: '11',
	txt: [ 'Розташування транспортних засобів на дорозі', ],
	//href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n481', 
},


{
	id: '12', chapter: '12',
	txt: [ 'Швидкість руху', ],
	//href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n499', 
},
	{
		id: '12.9', chapter: '12', part: '9',
		txt: [ 'Водієві забороняється:', ],
		//href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n517', 
	},
		{
			id: '12.9.б', chapter: '12', part: '9', paragraph: 'б',
			txt: [ 'перевищувати максимальну швидкість, зазначену в пунктах 12.4-12.7, на ділянці дороги, де встановлено дорожні знаки 3.29, 3.31, або на транспортному засобі, на якому встановлено розпізнавальний знак відповідно до підпункту "и" пункту 30.3 цих Правил', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n519', 
		},

{
	id: '15', chapter: '15',
	txt: [ 'Зупинка і стоянка', ],
	//href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n563', 
},
	{
		id: '15.4', chapter: '15', part: '4',
		txt: [ 'Транспортні засоби не дозволяється ставити на проїзній частині в два і більше ряди. Велосипеди, мопеди і мотоцикли без бокового причепа дозволяється ставити на проїзній частині не більше ніж у два ряди.', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n568', 
	},
	{
		id: '15.9', chapter: '15', part: '9',
		txt: [ 'Зупинка забороняється:', ],
		//href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n576', 
	},
		{
			id: '15.9.г', chapter: '15', part: '9', paragraph: 'г',
			txt: [ 'на пішохідних переходах і ближче 10 м від них з обох боків, крім випадків надання переваги в русі', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n580', 
		},
		{
			id: '15.9.ґ', chapter: '15', part: '9', paragraph: 'ґ',
			txt: [ 'на перехрестях та ближче 10 м від краю перехрещуваної проїзної частини за відсутності на них пішохідного переходу, за винятком зупинки для надання переваги в русі та зупинки проти бокового проїзду на Т-подібних перехрестях, де є суцільна лінія розмітки або розділювальна смуга', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n581', 
		},
		{
			id: '15.9.е', chapter: '15', part: '9', paragraph: 'е',
			txt: [ 'ближче 30 м від посадкових майданчиків для зупинки маршрутних транспортних засобів, а коли їх немає - ближче 30 м від дорожнього знака такої зупинки з обох боків', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n583', 
		},
		{
			id: '15.9.и', chapter: '15', part: '9', paragraph: 'и',
			txt: [ 'ближче 10 м від виїздів з прилеглих територій і безпосередньо в місці виїзду', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n587', 
		},

	{
		id: '15.10', chapter: '15', part: '10',
		txt: [ 'Стоянка забороняється:', ],
		//href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n588', 
	},
		{
			id: '15.10.в', chapter: '15', part: '10', paragraph: 'в',
			txt: [ 'на тротуарах, за винятком легкових автомобілів та мотоциклів, які можуть бути поставлені на краю тротуарів, де для руху пішоходів залишається щонайменше 2 м', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n591', 
		},




{
	id: '17', chapter: '17',
	txt: [ 'Переваги маршрутних транспортних засобів', ],
},




{
	id: '19', chapter: '19',
	txt: [ 'Користування зовнішніми світловими приладами', ],
},
	{
		id: '19.1', chapter: '19', part: '1',
		txt: [ 'У темну пору доби та в умовах недостатньої видимості незалежно від ступеня освітлення дороги, а також у тунелях на транспортному засобі, що рухається, повинні бути ввімкнені такі світлові пристрої:', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n645', 
	},





{
	id: '20', chapter: '20',
	txt: [ 'Рух через залізничні переїзди', ],
},
	{
		id: '20.5', chapter: '20', part: '5',
		txt: [ 'Рух через переїзд забороняється, якщо:', ],
	},
		{
			id: '20.5.в', chapter: '20', part: '5', paragraph: 'в',
			txt: [ 'увімкнено заборонний сигнал світлофора чи звуковий сигнал незалежно від наявності та положення шлагбаума', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n670', 
		},
		{
			id: '20.5.г', chapter: '20', part: '5', paragraph: 'г',
			txt: [ 'за переїздом утворився затор, який змусить водія зупинитися на переїзді', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n671', 
		},


{
	id: '31', chapter: '31',
	txt: [ 'Технічний стан транспортних засобів та їх обладнання', ],
},
	{
		id: '31.1', chapter: '31', part: '1',
		txt: [ 'Технічний стан транспортних засобів та їх обладнання повинні відповідати вимогам стандартів, що стосуються безпеки дорожнього руху та охорони навколишнього середовища, а також правил технічної експлуатації, інструкцій підприємств-виробників та іншої нормативно-технічної документації.', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n834', 
	},
	{
		id: '31.4', chapter: '31', part: '4',
		txt: [ 'Забороняється експлуатація транспортних засобів згідно із законодавством за наявності таких технічних несправностей і невідповідності таким вимогам:', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n842', 
	},
		{
			id: '31.4.3', chapter: '31', part: '4', paragraph: '3',
			txt: [ 'Зовнішні світлові прилади:', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n863', 
		},


















		{
			id: '31.4.7', chapter: '31', part: '4', paragraph: '7',
			txt: [ 'Інші елементи конструкції:', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n887', 
		},
			{
				id: '31.4.7.а', chapter: '31', part: '4', paragraph: '7', item: 'а',
				txt: [ 'немає передбачених конструкцією транспортного засобу стекол, дзеркал заднього виду', ],
				href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n888', 
			},



	{
		id: '31.6', chapter: '31', part: '6',
		txt: [ 'Забороняється подальший рух транспортних засобів, у яких:', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n912', 
	},
		{
			id: '31.6.б', chapter: '31', part: '6', paragraph: 'б',
			txt: [ 'у темну пору доби або в умовах недостатньої видимості не горять лампи фар чи задніх габаритних ліхтарів;', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n914', 
		},




{
	id: '34', chapter: '34',
	txt: [ 'Дорожня розмітка', ],
	href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n1208',
	descrimg: 'https://pdr.infotech.gov.ua/theory/road-markings',
},
	{
		id: '34.1', chapter: '34.1', part: '1',
		txt: [ 'Горизонтальна розмітка', ],
		href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n2365',
	},
		{
			id: '34.1.1', chapter: '34', part: '1', paragraph: '1',
			txt: [ '(вузька суцільна лінія) - поділяє транспортні потоки протилежних напрямків (осьова розмітка) на дорогах з двома чи трьома (2 + 1) смугами руху в обох напрямках, позначає межі смуг руху у попутному напрямку (розділювальна розмітка), позначає межі проїзної частини, на які в’їзд заборонено (напрямні острівці та острівці безпеки); розділяє пішохідний і велосипедний рух на суміжних пішохідних та велосипедних доріжках, позначених знаком 4.18; розділяє смуги на велосипедних доріжках з двостороннім рухом у разі наближення до велосипедного переїзду, позначеного розміткою 1.15', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n2369',
			descrimg: 'https://pdr.infotech.gov.ua/theory/road-markings/1.1',
		},
		{
			id: '34.1.3', chapter: '34', part: '1', paragraph: '3',
			txt: [ 'поділяє транспортні потоки протилежних напрямків на дорогах, які мають чотири і більше смуг руху або на ділянках доріг з трьома (2 + 1) смугами', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n2372',
			descrimg: 'https://pdr.infotech.gov.ua/theory/road-markings/1.3',
		},
		{
			id: '34.1.12', chapter: '34', part: '1', paragraph: '12',
			txt: [ '(стоп-лінія) - позначає місце, де водій повинен зупинитися за наявності знака 2.2 або за сигналу світлофора чи регулювальника, що забороняє рух', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n2384',
			descrimg: 'https://pdr.infotech.gov.ua/theory/road-markings/1.12',
		},
		{
			id: '34.1.35', chapter: '34', part: '1', paragraph: '35',
			txt: [ 'позначає місця для паркування індивідуального транспорту осіб з інвалідністю та транспортних засобів, які перевозять осіб з інвалідністю', ],
			href: 'https://zakon.rada.gov.ua/laws/show/1306-2001-%D0%BF#n2414',
			descrimg: 'https://pdr.infotech.gov.ua/theory/road-markings/1.35',
		},

{
	id: 'sign_2', sign: '2',
	txt: [ 'Знаки пріоритету', ],
},
	{
		id: 'sign_2.1', sign: '2', part: '1', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/2.1',
		title: [ 'Дати дорогу', ],
	},
	{
		id: 'sign_2.2', sign: '2', part: '2', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/2.2',
		title: [ 'Проїзд без зупинки заборонено', ],
	},
	{
		id: 'sign_2.5', sign: '2', part: '5', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/2.5',
		title: [ 'Перевага зустрічного руху', ],
	},




{
	id: 'sign_3', sign: '3',
	txt: [ 'Заборонні знаки', ],
},
	{
		id: 'sign_3.1', sign: '3', part: '1', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.1',
		title: [ 'Рух заборонено', ],
	},
	{
		id: 'sign_3.2', sign: '3', part: '2', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.2',
		title: [ 'Рух механічних транспортних засобів заборонено', ],
	},
	{
		id: 'sign_3.21', sign: '3', part: '21', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.21',
		title: [ 'В\'їзд заборонено', ],
	},
	{
		id: 'sign_3.22', sign: '3', part: '22', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.22',
		title: [ 'Поворот праворуч заборонено', ],
	},
	{
		id: 'sign_3.23', sign: '3', part: '23', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.23',
		title: [ 'Поворот ліворуч заборонено', ],
	},
	{
		id: 'sign_3.25', sign: '3', part: '25', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.25',
		title: [ 'Обгін заборонено', ],
	},
	{
		id: 'sign_3.29', sign: '3', part: '29', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.29',
		title: [ 'Обмеження максимальної швидкості', ],
	},
	{
		id: 'sign_3.34', sign: '3', part: '34', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.34',
		title: [ 'Зупинку заборонено', ],
	},
	{
		id: 'sign_3.35', sign: '3', part: '35', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.35',
		title: [ 'Стоянку заборонено', ],
	},
	{
		id: 'sign_3.41', sign: '3', part: '41', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.41',
		title: [ 'Контроль', ],
	},
	{
		id: 'sign_3.41', sign: '3', part: '41', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/3.41',
		title: [ 'Контроль', ],
	},





{
	id: 'sign_4', sign: '4',
	txt: [ 'Наказові знаки', ],
},
	{
		id: 'sign_4.1', sign: '4', part: '1', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.1',
		title: [ 'Рух прямо', ],
	},
	{
		id: 'sign_4.2', sign: '4', part: '2', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.2',
		title: [ 'Рух праворуч', ],
	},
	{
		id: 'sign_4.5', sign: '4', part: '5', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.5',
		title: [ 'Рух прямо або ліворуч', ],
	},
	{
		id: 'sign_4.6', sign: '4', part: '6', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.6',
		title: [ 'Рух праворуч або ліворуч', ],
	},
	{
		id: 'sign_4.7', sign: '4', part: '7', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/4.7',
		title: [ 'Об’їзд перешкоди з правого боку', ],
	},


{
	id: 'sign_5', sign: '5', 
	title: [ 'Інформаційно-вказівні знаки', ],
},
	{
		id: 'sign_5.16', sign: '5', part: '16', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.16',
		title: [ 'Напрямки руху по смугах', ],
	},
	{
		id: 'sign_5.38.1', sign: '5', part: '38', paragraph: '1', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.38.1',
		title: [ 'Пішохідний перехід', ],
	},
	{
		id: 'sign_5.38.2', sign: '5', part: '38', paragraph: '2', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.38.2',
		title: [ 'Пішохідний перехід', ],
	},
	{
		id: 'sign_5.45.1', sign: '5', part: '45', paragraph: '1', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.45.1',
		title: [ 'Пункт зупинки автобуса', ],
	},
	{
		id: 'sign_5.46.1', sign: '5', part: '46', paragraph: '1', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.46.1',
		title: [ 'Пункт зупинки трамвая', ],
	},
	{
		id: 'sign_5.47.1', sign: '5', part: '47', paragraph: '1', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.47.1',
		title: [ 'Пункт зупинки тролейбуса', ],
	},
	{
		id: 'sign_5.48', sign: '5', part: '48', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.48',
		title: [ 'Місце зупинки таксі', ],
	},








{
	id: 'sign_5', sign: '5',
	txt: [ 'Інформаційно-вказівні знаки', ],
},
	{
		id: 'sign_5.8', sign: '5', part: '8', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.8',
		title: 'Дорога із смугою для руху маршрутних транспортних засобів',
		descr: [ 
			'Дорога, на якій по спеціально відведеній смузі здійснюється рух транспортних засобів за встановленим маршрутом та велосипедистів.',
		],
	},
	{
		id: 'sign_5.11', sign: '5', part: '11', href_sign: 'https://pdr.infotech.gov.ua/theory/road-signs/5.11',
		title: 'Смуга для руху маршрутних транспортних засобів',
		descr: [ 
			'Смуга призначена для руху транспортних засобів, що рухаються за встановленими маршрутами, та велосипедистів, якщо рух такою смугою здійснюється попутно загальному потоку транспортних засобів.',
			'Дія знака поширюється на смугу руху, над якою він установлений. Якщо знак установлений праворуч від дороги, його дія поширюється на праву смугу руху.',
			'Водію, який повертає праворуч на дорозі із смугою для маршрутних транспортних засобів, що відокремлена переривчастою лінією дорожньої розмітки, дозволено виконувати поворот із цієї смуги. У таких місцях дозволяється також заїжджати на неї під час виїзду на дорогу і для посадки чи висадки пасажирів біля правого краю проїзної частини.',
		],
	},







*/






];









let objListSheriffPdr = {};
arrListSheriffPdr.forEach( k => {
	objListSheriffPdr[ k.id ] = k;
});







