

const arrListSheriffNpu = [


{ 
	id: 'art_46', art: '46', title: 'Застосування вогнепальної зброї', href: 'https://zakon.rada.gov.ua/laws/show/580-19#n446', 
	parts: [
		{ title: '1. Застосування вогнепальної зброї є найбільш суворим заходом примусу.', },
		{ title: '2. Поліцейський уповноважений на зберігання, носіння вогнепальної зброї, а також на її застосування і використання лише за умови що він пройшов відповідну спеціальну підготовку.', },
		{ title: '3. Порядок зберігання і носіння вогнепальної зброї, що знаходиться в розпорядженні поліцейського, перелік вогнепальної зброї та боєприпасів, що використовуються в діяльності поліції, та норми їх належності встановлюються Міністром внутрішніх справ України.', },
		{ 
			title: '4. Поліцейський уповноважений у виняткових випадках застосовувати вогнепальну зброю:', 
			arr: [
				{ title: '1) для відбиття нападу на поліцейського або членів його сім\'ї, у випадку загрози їхньому життю чи здоров\'ю;', },
				{ title: '2) для захисту осіб від нападу, що загрожує їхньому життю чи здоров\'ю;', },
				{ title: '3) для звільнення заручників або осіб, яких незаконно позбавлено волі;', },
				{ title: '4) для відбиття нападу на об\'єкти, що перебувають під охороною, конвої, житлові та нежитлові приміщення, а також звільнення таких об\'єктів у разі їх захоплення;', },
				{ title: '5) для затримання особи, яку застали під час вчинення тяжкого або особливо тяжкого злочину і яка намагається втекти;', },
				{ title: '6) для затримання особи, яка чинить збройний опір, намагається втекти з-під варти, а також озброєної особи, яка погрожує застосуванням зброї та інших предметів, що загрожують життю і здоров\'ю людей та/або поліцейського;', },
				{ title: '7) для зупинки транспортного засобу шляхом його пошкодження, якщо водій своїми діями створює загрозу життю чи здоров\'ю людей та/або поліцейського;', },
				{ title: '8) для примусового припинення польоту безпілотного повітряного судна, якщо є обґрунтовані підстави вважати, що таке судно використовується для вчинення правопорушення або становить загрозу життю чи здоров\'ю людей та/або поліцейського, шляхом пошкодження чи знищення безпілотного повітряного судна та/або складових частин безпілотної авіаційної системи.', },
			],
		},
		{ title: '5. Поліцейський уповноважений застосовувати вогнепальну зброю тільки після попередження про необхідність припинення протиправних дій і намір використання заходу примусу, визначеного цією статтею.', },
		{ 
			title: '6. Застосування вогнепальної зброї без попередження допускається:', 
			arr: [
				{ title: '1) при спробі особи, яку затримує поліцейський із вогнепальною зброєю в руках, наблизитися до нього, скоротивши визначену ним відстань, чи доторкнутися до зброї;', },
				{ title: '2) у разі збройного нападу, а також у разі раптового нападу із застосуванням бойової техніки, транспортних засобів або інших засобів, що загрожують життю чи здоров\'ю людей;', },
				{ title: '3) якщо особа, затримана або заарештована за вчинення особливо тяжкого чи тяжкого злочину, втікає із застосуванням транспортного засобу;', },
				{ title: '4) якщо особа чинить збройний опір;', },
				{ title: '5) для припинення спроби заволодіти вогнепальною зброєю.', },
			],
		},
		{ title: '7. Поліцейський уповноважений застосовувати вогнепальну зброю тільки з метою заподіяння особі такої шкоди, яка є необхідною і достатньою в такій обстановці, для негайного відвернення чи припинення збройного нападу.', },
		{ title: '8. Поліцейський уповноважений застосовувати вогнепальну зброю у разі збройного нападу, якщо відвернення чи припинення відповідного нападу неможливо досягнути іншими засобами.', },
		{ title: '9. Поліцейському заборонено застосовувати вогнепальну зброю в місцях, де може бути завдано шкоди іншим особам, а також у вогненебезпечних та вибухонебезпечних місцях, крім випадків необхідності відбиття нападу або крайньої необхідності.', },
		{ title: '10. Поліцейський зобов\'язаний у письмовій формі повідомляти свого керівника про застосування вогнепальної зброї, а також негайно повідомити свого керівника про активне застосування вогнепальної зброї, який, у свою чергу, зобов\'язаний поінформувати центральний орган управління поліції та відповідного прокурора.', },
		{ title: '11. Поліцейський може взяти до рук вогнепальну зброю і привести її у готовність, якщо вважає, що в обстановці, що склалася, можуть виникнути підстави для її застосування.', },
		{ title: `
			12. Під час затримання осіб, щодо яких у поліцейського виникла підозра у вчиненні тяжкого чи особливо тяжкого злочину, а також під час перевірки документів у таких осіб поліцейський може привести в готовність вогнепальну зброю та попередити особу про можливість її застосування.
			<br/><br/>Спроба особи, яку затримує поліцейський із вогнепальною зброєю в руках, наблизитися до нього, скоротивши визначену поліцейським відстань, чи доторкнутися до зброї є підставою для застосування вогнепальної зброї поліцейським.
		`, },
		{ title: '13. Поліцейський може використати вогнепальну зброю для подання сигналу тривоги або виклику допоміжних сил, або для знешкодження тварини, яка загрожує життю чи здоров\'ю поліцейського та інших осіб.', },
	],

},







];









let objListSheriffNpu = {};
arrListSheriffNpu.forEach( k => {
	objListSheriffNpu[ k.id ] = k;
});







