// © 2023 DJS 
 
 
 
 
 
class ComponentWinRights { 
 
 
 
	static args = {}; 
 
 
 
	static html( objData = {} ) { 
		const fooName = this.name + '.html()'; 
 
		this.args = objData.args ? objData.args : {}; 
 
 
 
		let tagParam = { 
			//'class' 		: '', 
			//'name' 		: '', 
			//'title' 		: '', 
			//'data-id' 	: '', 
			//'onclick' 	: '', 
			//'selected' 	: '', 
			//'defer' 		: '', 
		}; 
 
 
 
		let html = `

			<div class="law">
				<div class="title-link">
					<a href="https://zakon.rada.gov.ua/laws/show/580-19#Text" target="_blank">
						<div><b>ЗАКОН УКРАЇНИ</b></div>
						<div><b>Про Національну поліцію${ symbolLink }</b></div>
					</a>
				</div> 

				<div>
					<b>Стаття 35.</b> Зупинення транспортного засобу 
				</div>
				<p>
					<a href="https://zakon.rada.gov.ua/laws/show/580-19#n282" target="_blank">
						<b>Частина 1.${ symbolLink }</b>
					</a>
					Поліцейський може зупиняти транспортні засоби у разі: 
				</p>
				<p><b>Пункт 1)</b> якщо водій порушив Правила дорожнього руху;</p>
				<p><b>Пункт 2)</b> якщо є очевидні ознаки, що свідчать про технічну несправність транспортного засобу;</p>
				<p><b>Пункт 4)</b> якщо транспортний засіб перебуває в розшуку;</p>
				<p><b>Пункт 6)</b> якщо необхідно залучити водія транспортного засобу до надання допомоги іншим учасникам дорожнього руху або поліцейським або як свідка під час оформлення протоколів про адміністративні правопорушення чи матеріалів дорожньо-транспортних пригод;</p>	
				<p><b>Пункт 11)</b> якщо є наявна інформація, яка свідчить про те, що водій або пасажир транспортного засобу є особою, яка самовільно залишила місце для утримання військовополонених.</p>
			</div>

			<div class="law">
				<div class="title-link">
					<a href="https://zakon.rada.gov.ua/laws/show/254%D0%BA/96-%D0%B2%D1%80#Text" target="_blank">
						<div><b>КОНСТИТУЦІЯ УКРАЇНИ${ symbolLink }</b></div>
					</a>
				</div>

				<p>
					<a href="" target="_blank">
						<b>Стаття 10.${ symbolLink }</b> 
					</a>
					Державною мовою в Україні є українська мова.
				</p>

				<p>
					<a href="https://zakon.rada.gov.ua/laws/show/254%D0%BA/96-%D0%B2%D1%80#n4378" target="_blank">
						<b>Стаття 63.${ symbolLink }</b> 
					</a>
					Особа не несе відповідальності за відмову давати показання або пояснення щодо себе, членів сім'ї чи близьких родичів, коло яких визначається законом.
				</p>
				
			</div>

			<div class="law">
				<div class="title-link">
					<div>
						<a href="https://zakon.rada.gov.ua/laws/show/80731-10#Text" target="_blank">
							<b>КУпАП${ symbolLink }</b>
						</a>
					</div>
				</div>

				<p>
					<a href="https://zakon.rada.gov.ua/laws/show/80732-10#n607" target="_blank">
						<b>Стаття 268.${ symbolLink }</b> 
					</a>
					Права особи, яка притягається до адміністративної відповідальності
				</p>

				<div>Особа, яка притягається до адміністративної відповідальності має право:</div>
				<div>- знайомитися з матеріалами справи,</div>
				<div>- давати пояснення,</div>
				<div>- подавати докази,</div>
				<div>- заявляти клопотання;</div>
				<div>- при розгляді справи користуватися юридичною допомогою адвоката, іншого фахівця у галузі права, який за законом має право на надання правової допомоги особисто чи за дорученням юридичної особи,</div>
				<div>- виступати рідною мовою і користуватися послугами перекладача, якщо не володіє мовою, якою ведеться провадження;</div>
				<div>- оскаржити постанову по справі.</div>
				
				<br/>

				<p>
					<a href="https://zakon.rada.gov.ua/laws/show/80732-10#n951" target="_blank">
						<b>Стаття 307.${ symbolLink }</b> 
					</a>
					Строки і порядок виконання постанови про накладення штрафу
				</p>

				<p>Штраф має бути сплачений порушником не пізніш як через п’ятнадцять днів з дня вручення йому постанови про накладення штрафу, а в разі оскарження такої постанови - не пізніш як через п’ятнадцять днів з дня повідомлення про залишення скарги без задоволення.</p>
				<p>Штраф, накладений за вчинення адміністративного правопорушення, вноситься порушником в установу банку України, за винятком штрафу, що стягується на місці вчинення правопорушення, якщо інше не встановлено законодавством України.</p>

			</div>
		`;
 



 
		setMeta({ 
			title 			: name, 
			description 	: 'Опис...', 
			//image 		: '', 
		}); 
 
 
 
		return { html, tagParam };  
	} 
 
 
 
 
 
	static clc( data ) { 
		const fooName = this.name + '.clc()'; 
 
		//cns( 'var', 'fooName', fooName ); 
		//cns( 'var', 'data', data ); 
 
	} 
 
 
 
 
 
} 
 
 
 	
 
 
 
 
 	
 
 
