// © 2023 DJS 
 
 
 
 
 
class ComponentWinRights { 
 
 
 
	static args = {}; 
 
 
 
	static html( objData = {} ) { 
		const fooName = this.name + '.html()'; 
 
		this.args = objData.args ? objData.args : {}; 
 
 
 
		let tagParam = { 
			//'class' 		: '', 
			//'name' 		: '', 
			//'title' 		: '', 
			//'data-id' 	: '', 
			//'onclick' 	: '', 
			//'selected' 	: '', 
			//'defer' 		: '', 
		}; 
 
 
 
		let html = `

			<div class="law">
				<div><a href="https://zakon.rada.gov.ua/laws/show/580-19#Text" target="_blank"><b>ЗАКОН УКРАЇНИ</b> Про Національну поліцію</a></div>
				<div><b>Стаття 35.</b> Зупинення транспортного засобу</div>
				<div>Частина 1. Поліцейський може зупиняти транспортні засоби у разі:</div>
				<div><b>Пункт 1)</b> якщо водій порушив Правила дорожнього руху;</div>
			</div>

			<div class="law">
				<div><a href="https://zakon.rada.gov.ua/laws/show/254%D0%BA/96-%D0%B2%D1%80#Text" target="_blank"><b>КОНСТИТУЦІЯ УКРАЇНИ</b></a></div>
				<div><b>Розділ II</b>ПРАВА, СВОБОДИ ТА ОБОВ'ЯЗКИ ЛЮДИНИ І ГРОМАДЯНИНА</div>
				<div><b>Стаття 63.</b> Особа не несе відповідальності за відмову давати показання або пояснення щодо себе, членів сім'ї чи близьких родичів, коло яких визначається законом.</div>
				<div>Підозрюваний, обвинувачений чи підсудний має право на захист.</div>
				<div>Засуджений користується всіма правами людини і громадянина, за винятком обмежень, які визначені законом і встановлені вироком суду.</div>
			</div>

			<div class="law">
				<div><a href="https://zakon.rada.gov.ua/laws/show/80731-10#Text" target="_blank"><b>КУпАП</b></a></div>
				<div><b>Глава 21.</b> ОСОБИ, ЯКІ БЕРУТЬ УЧАСТЬ У ПРОВАДЖЕННІ В СПРАВІ ПРО АДМІНІСТРАТИВНЕ ПРАВОПОРУШЕННЯ</div>
				<div><b>Стаття 268.</b> Права особи, яка притягається до адміністративної відповідальності</div>


				<div>Особа, яка притягається до адміністративної відповідальності має право:</div>
						<div>- знайомитися з матеріалами справи,</div>
						<div>- давати пояснення,</div>
						<div>- подавати докази,</div>
						<div>- заявляти клопотання;</div>
						<div>- при розгляді справи користуватися юридичною допомогою адвоката, іншого фахівця у галузі права, який за законом має право на надання правової допомоги особисто чи за дорученням юридичної особи,</div>
						<div>- виступати рідною мовою і користуватися послугами перекладача, якщо не володіє мовою, якою ведеться провадження;</div>
						<div>- оскаржити постанову по справі.</div>

				<div>Справа про адміністративне правопорушення розглядається в присутності особи, яка притягається до адміністративної відповідальності.</div>
				<div>Під час відсутності цієї особи справу може бути розглянуто лише у випадках, коли є дані про своєчасне її сповіщення про місце і час розгляду справи і якщо від неї не надійшло клопотання про відкладення розгляду справи.</div>
				<div>Особливості розгляду справ про адміністративні правопорушення у сферах забезпечення безпеки дорожнього руху, зафіксовані в автоматичному режимі, безпеки на автомобільному транспорті та про порушення правил зупинки, стоянки, паркування транспортних засобів, зафіксовані в режимі фотозйомки (відеозапису), встановлюються статтями 279-1-279-8 цього Кодексу.</div>
			</div>









		`;

 
 



 
		setMeta({ 
			title 			: name, 
			description 	: 'Опис...', 
			//image 		: '', 
		}); 
 
 
 
		return { html, tagParam };  
	} 
 
 
 
 
 
	static clc( data ) { 
		const fooName = this.name + '.clc()'; 
 
		//cns( 'var', 'fooName', fooName ); 
		//cns( 'var', 'data', data ); 
 
	} 
 
 
 
 
 
} 
 
 
 	
 
 
 
 
 	
 
 
